
# State **`s3://infrahouse-github-control-state/terraform.tfstate`**
## Affected resources counts

|   Success |   🟢 Add |    Change |    Destroy |
|----------:|---------:|----------:|-----------:|
|        ✅ |       47 |         0 |          0 |
## Affected resources by action

|  Action  | Resources                                                                                             |
|:--------:|:------------------------------------------------------------------------------------------------------|
|    🟢    | `module.repos["terraform-aws-actions-runner"].github_repository_file.commit_msg_hook[0]`              |
|    🟢    | `module.repos["terraform-aws-aerospike"].github_repository_file.commit_msg_hook[0]`                   |
|    🟢    | `module.repos["terraform-aws-bookstack"].github_repository_file.commit_msg_hook[0]`                   |
|    🟢    | `module.repos["terraform-aws-ci-cd"].github_repository_file.commit_msg_hook[0]`                       |
|    🟢    | `module.repos["terraform-aws-cloud-init"].github_repository_file.commit_msg_hook[0]`                  |
|    🟢    | `module.repos["terraform-aws-cloudcraft-role"].github_repository_file.commit_msg_hook[0]`             |
|    🟢    | `module.repos["terraform-aws-cost-alert"].github_repository_file.commit_msg_hook[0]`                  |
|    🟢    | `module.repos["terraform-aws-debian-repo"].github_repository_file.commit_msg_hook[0]`                 |
|    🟢    | `module.repos["terraform-aws-dms"].github_repository_file.commit_msg_hook[0]`                         |
|    🟢    | `module.repos["terraform-aws-ecr"].github_repository_file.commit_msg_hook[0]`                         |
|    🟢    | `module.repos["terraform-aws-ecs"].github_repository_file.commit_msg_hook[0]`                         |
|    🟢    | `module.repos["terraform-aws-elasticsearch"].github_repository_file.commit_msg_hook[0]`               |
|    🟢    | `module.repos["terraform-aws-emrserverless"].github_repository_file.commit_msg_hook[0]`               |
|    🟢    | `module.repos["terraform-aws-gh-identity-provider"].github_repository_file.commit_msg_hook[0]`        |
|    🟢    | `module.repos["terraform-aws-gha-admin"].github_repository_file.commit_msg_hook[0]`                   |
|    🟢    | `module.repos["terraform-aws-github-backup"].github_repository_file.commit_msg_hook[0]`               |
|    🟢    | `module.repos["terraform-aws-github-backup-configuration"].github_repository_file.commit_msg_hook[0]` |
|    🟢    | `module.repos["terraform-aws-github-role"].github_repository_file.commit_msg_hook[0]`                 |
|    🟢    | `module.repos["terraform-aws-guardduty-configuration"].github_repository_file.commit_msg_hook[0]`     |
|    🟢    | `module.repos["terraform-aws-http-redirect"].github_repository_file.commit_msg_hook[0]`               |
|    🟢    | `module.repos["terraform-aws-instance-profile"].github_repository_file.commit_msg_hook[0]`            |
|    🟢    | `module.repos["terraform-aws-iso27001"].github_repository_file.commit_msg_hook[0]`                    |
|    🟢    | `module.repos["terraform-aws-jumphost"].github_repository_file.commit_msg_hook[0]`                    |
|    🟢    | `module.repos["terraform-aws-key"].github_repository_file.commit_msg_hook[0]`                         |
|    🟢    | `module.repos["terraform-aws-kibana"].github_repository_file.commit_msg_hook[0]`                      |
|    🟢    | `module.repos["terraform-aws-lambda-monitored"].github_repository_file.commit_msg_hook[0]`            |
|    🟢    | `module.repos["terraform-aws-openvpn"].github_repository_file.commit_msg_hook[0]`                     |
|    🟢    | `module.repos["terraform-aws-pmm-ecs"].github_repository_file.commit_msg_hook[0]`                     |
|    🟢    | `module.repos["terraform-aws-postfix"].github_repository_file.commit_msg_hook[0]`                     |
|    🟢    | `module.repos["terraform-aws-pypiserver"].github_repository_file.commit_msg_hook[0]`                  |
|    🟢    | `module.repos["terraform-aws-registry"].github_repository_file.commit_msg_hook[0]`                    |
|    🟢    | `module.repos["terraform-aws-s3-bucket"].github_repository_file.commit_msg_hook[0]`                   |
|    🟢    | `module.repos["terraform-aws-secret"].github_repository_file.commit_msg_hook[0]`                      |
|    🟢    | `module.repos["terraform-aws-secret-policy"].github_repository_file.commit_msg_hook[0]`               |
|    🟢    | `module.repos["terraform-aws-service-network"].github_repository_file.commit_msg_hook[0]`             |
|    🟢    | `module.repos["terraform-aws-sqs-ecs"].github_repository_file.commit_msg_hook[0]`                     |
|    🟢    | `module.repos["terraform-aws-sqs-pod"].github_repository_file.commit_msg_hook[0]`                     |
|    🟢    | `module.repos["terraform-aws-state-bucket"].github_repository_file.commit_msg_hook[0]`                |
|    🟢    | `module.repos["terraform-aws-state-manager"].github_repository_file.commit_msg_hook[0]`               |
|    🟢    | `module.repos["terraform-aws-tags-override"].github_repository_file.commit_msg_hook[0]`               |
|    🟢    | `module.repos["terraform-aws-tcp-pod"].github_repository_file.commit_msg_hook[0]`                     |
|    🟢    | `module.repos["terraform-aws-teleport"].github_repository_file.commit_msg_hook[0]`                    |
|    🟢    | `module.repos["terraform-aws-teleport-agent"].github_repository_file.commit_msg_hook[0]`              |
|    🟢    | `module.repos["terraform-aws-terraformer"].github_repository_file.commit_msg_hook[0]`                 |
|    🟢    | `module.repos["terraform-aws-truststore"].github_repository_file.commit_msg_hook[0]`                  |
|    🟢    | `module.repos["terraform-aws-update-dns"].github_repository_file.commit_msg_hook[0]`                  |
|    🟢    | `module.repos["terraform-aws-website-pod"].github_repository_file.commit_msg_hook[0]`                 |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.repos["terraform-aws-actions-runner"].github_repository_file.commit_msg_hook[0] will be created
  + resource "github_repository_file" "commit_msg_hook" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add commit-msg hook"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            #!/usr/bin/env bash
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            
            # Validates commit messages follow conventional commit format
            # See: https://www.conventionalcommits.org/
            
            set -e
            
            commit_msg_file=$1
            commit_msg=$(cat "$commit_msg_file")
            
            # Skip validation for merge commits
            if echo "$commit_msg" | grep -qE '^Merge (branch|pull request)'; then
                exit 0
            fi
            
            # Conventional commit pattern
            # Supports: type(scope): description or type: description
            # Types: feat, fix, docs, style, refactor, perf, test, build, ci, chore, revert, security
            # Optional ! for breaking changes: feat!: description
            pattern='^(feat|fix|docs|style|refactor|perf|test|build|ci|chore|revert|security)(\(.+\))?!?: .{1,}'
            
            if ! echo "$commit_msg" | grep -qE "$pattern"; then
                echo "❌ Invalid commit message format"
                echo ""
                echo "📝 Commit message must follow Conventional Commits:"
                echo ""
                echo "  <type>[optional scope][!]: <description>"
                echo ""
                echo "  [optional body]"
                echo ""
                echo "  [optional footer(s)]"
                echo ""
                echo "Types:"
                echo "  feat:     ✨ New feature"
                echo "  fix:      🐛 Bug fix"
                echo "  docs:     📚 Documentation changes"
                echo "  security: 🔒 Security improvements"
                echo "  refactor: ♻️  Code refactoring (no functional changes)"
                echo "  perf:     ⚡ Performance improvement"
                echo "  test:     ✅ Adding or updating tests"
                echo "  build:    🔧 Build system or dependency changes"
                echo "  ci:       👷 CI/CD configuration changes"
                echo "  chore:    🔨 Maintenance tasks"
                echo "  revert:   ⏪ Revert a previous commit"
                echo "  style:    💄 Code style changes (formatting, etc.)"
                echo ""
                echo "Breaking changes:"
                echo "  Use ! after type: feat!: breaking change description"
                echo ""
                echo "Examples:"
                echo "  ✓ feat: add deregistration delay configuration"
                echo "  ✓ fix: correct unhealthy threshold variable name"
                echo "  ✓ security: add S3 bucket encryption for access logs"
                echo "  ✓ docs: improve variable descriptions using HEREDOC"
                echo "  ✓ feat(alb): add listener rule priority documentation"
                echo "  ✓ feat!: remove deprecated variables (breaking change)"
                echo ""
                echo "Your message:"
                echo "  $commit_msg"
                echo ""
                echo "See: https://www.conventionalcommits.org/"
                exit 1
            fi
            
            # Success - message is valid
            exit 0
        EOT
      + file                         = "./hooks/commit-msg"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-actions-runner"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-aerospike"].github_repository_file.commit_msg_hook[0] will be created
  + resource "github_repository_file" "commit_msg_hook" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add commit-msg hook"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            #!/usr/bin/env bash
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            
            # Validates commit messages follow conventional commit format
            # See: https://www.conventionalcommits.org/
            
            set -e
            
            commit_msg_file=$1
            commit_msg=$(cat "$commit_msg_file")
            
            # Skip validation for merge commits
            if echo "$commit_msg" | grep -qE '^Merge (branch|pull request)'; then
                exit 0
            fi
            
            # Conventional commit pattern
            # Supports: type(scope): description or type: description
            # Types: feat, fix, docs, style, refactor, perf, test, build, ci, chore, revert, security
            # Optional ! for breaking changes: feat!: description
            pattern='^(feat|fix|docs|style|refactor|perf|test|build|ci|chore|revert|security)(\(.+\))?!?: .{1,}'
            
            if ! echo "$commit_msg" | grep -qE "$pattern"; then
                echo "❌ Invalid commit message format"
                echo ""
                echo "📝 Commit message must follow Conventional Commits:"
                echo ""
                echo "  <type>[optional scope][!]: <description>"
                echo ""
                echo "  [optional body]"
                echo ""
                echo "  [optional footer(s)]"
                echo ""
                echo "Types:"
                echo "  feat:     ✨ New feature"
                echo "  fix:      🐛 Bug fix"
                echo "  docs:     📚 Documentation changes"
                echo "  security: 🔒 Security improvements"
                echo "  refactor: ♻️  Code refactoring (no functional changes)"
                echo "  perf:     ⚡ Performance improvement"
                echo "  test:     ✅ Adding or updating tests"
                echo "  build:    🔧 Build system or dependency changes"
                echo "  ci:       👷 CI/CD configuration changes"
                echo "  chore:    🔨 Maintenance tasks"
                echo "  revert:   ⏪ Revert a previous commit"
                echo "  style:    💄 Code style changes (formatting, etc.)"
                echo ""
                echo "Breaking changes:"
                echo "  Use ! after type: feat!: breaking change description"
                echo ""
                echo "Examples:"
                echo "  ✓ feat: add deregistration delay configuration"
                echo "  ✓ fix: correct unhealthy threshold variable name"
                echo "  ✓ security: add S3 bucket encryption for access logs"
                echo "  ✓ docs: improve variable descriptions using HEREDOC"
                echo "  ✓ feat(alb): add listener rule priority documentation"
                echo "  ✓ feat!: remove deprecated variables (breaking change)"
                echo ""
                echo "Your message:"
                echo "  $commit_msg"
                echo ""
                echo "See: https://www.conventionalcommits.org/"
                exit 1
            fi
            
            # Success - message is valid
            exit 0
        EOT
      + file                         = "./hooks/commit-msg"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-aerospike"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-bookstack"].github_repository_file.commit_msg_hook[0] will be created
  + resource "github_repository_file" "commit_msg_hook" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add commit-msg hook"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            #!/usr/bin/env bash
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            
            # Validates commit messages follow conventional commit format
            # See: https://www.conventionalcommits.org/
            
            set -e
            
            commit_msg_file=$1
            commit_msg=$(cat "$commit_msg_file")
            
            # Skip validation for merge commits
            if echo "$commit_msg" | grep -qE '^Merge (branch|pull request)'; then
                exit 0
            fi
            
            # Conventional commit pattern
            # Supports: type(scope): description or type: description
            # Types: feat, fix, docs, style, refactor, perf, test, build, ci, chore, revert, security
            # Optional ! for breaking changes: feat!: description
            pattern='^(feat|fix|docs|style|refactor|perf|test|build|ci|chore|revert|security)(\(.+\))?!?: .{1,}'
            
            if ! echo "$commit_msg" | grep -qE "$pattern"; then
                echo "❌ Invalid commit message format"
                echo ""
                echo "📝 Commit message must follow Conventional Commits:"
                echo ""
                echo "  <type>[optional scope][!]: <description>"
                echo ""
                echo "  [optional body]"
                echo ""
                echo "  [optional footer(s)]"
                echo ""
                echo "Types:"
                echo "  feat:     ✨ New feature"
                echo "  fix:      🐛 Bug fix"
                echo "  docs:     📚 Documentation changes"
                echo "  security: 🔒 Security improvements"
                echo "  refactor: ♻️  Code refactoring (no functional changes)"
                echo "  perf:     ⚡ Performance improvement"
                echo "  test:     ✅ Adding or updating tests"
                echo "  build:    🔧 Build system or dependency changes"
                echo "  ci:       👷 CI/CD configuration changes"
                echo "  chore:    🔨 Maintenance tasks"
                echo "  revert:   ⏪ Revert a previous commit"
                echo "  style:    💄 Code style changes (formatting, etc.)"
                echo ""
                echo "Breaking changes:"
                echo "  Use ! after type: feat!: breaking change description"
                echo ""
                echo "Examples:"
                echo "  ✓ feat: add deregistration delay configuration"
                echo "  ✓ fix: correct unhealthy threshold variable name"
                echo "  ✓ security: add S3 bucket encryption for access logs"
                echo "  ✓ docs: improve variable descriptions using HEREDOC"
                echo "  ✓ feat(alb): add listener rule priority documentation"
                echo "  ✓ feat!: remove deprecated variables (breaking change)"
                echo ""
                echo "Your message:"
                echo "  $commit_msg"
                echo ""
                echo "See: https://www.conventionalcommits.org/"
                exit 1
            fi
            
            # Success - message is valid
            exit 0
        EOT
      + file                         = "./hooks/commit-msg"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-bookstack"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-ci-cd"].github_repository_file.commit_msg_hook[0] will be created
  + resource "github_repository_file" "commit_msg_hook" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add commit-msg hook"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            #!/usr/bin/env bash
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            
            # Validates commit messages follow conventional commit format
            # See: https://www.conventionalcommits.org/
            
            set -e
            
            commit_msg_file=$1
            commit_msg=$(cat "$commit_msg_file")
            
            # Skip validation for merge commits
            if echo "$commit_msg" | grep -qE '^Merge (branch|pull request)'; then
                exit 0
            fi
            
            # Conventional commit pattern
            # Supports: type(scope): description or type: description
            # Types: feat, fix, docs, style, refactor, perf, test, build, ci, chore, revert, security
            # Optional ! for breaking changes: feat!: description
            pattern='^(feat|fix|docs|style|refactor|perf|test|build|ci|chore|revert|security)(\(.+\))?!?: .{1,}'
            
            if ! echo "$commit_msg" | grep -qE "$pattern"; then
                echo "❌ Invalid commit message format"
                echo ""
                echo "📝 Commit message must follow Conventional Commits:"
                echo ""
                echo "  <type>[optional scope][!]: <description>"
                echo ""
                echo "  [optional body]"
                echo ""
                echo "  [optional footer(s)]"
                echo ""
                echo "Types:"
                echo "  feat:     ✨ New feature"
                echo "  fix:      🐛 Bug fix"
                echo "  docs:     📚 Documentation changes"
                echo "  security: 🔒 Security improvements"
                echo "  refactor: ♻️  Code refactoring (no functional changes)"
                echo "  perf:     ⚡ Performance improvement"
                echo "  test:     ✅ Adding or updating tests"
                echo "  build:    🔧 Build system or dependency changes"
                echo "  ci:       👷 CI/CD configuration changes"
                echo "  chore:    🔨 Maintenance tasks"
                echo "  revert:   ⏪ Revert a previous commit"
                echo "  style:    💄 Code style changes (formatting, etc.)"
                echo ""
                echo "Breaking changes:"
                echo "  Use ! after type: feat!: breaking change description"
                echo ""
                echo "Examples:"
                echo "  ✓ feat: add deregistration delay configuration"
                echo "  ✓ fix: correct unhealthy threshold variable name"
                echo "  ✓ security: add S3 bucket encryption for access logs"
                echo "  ✓ docs: improve variable descriptions using HEREDOC"
                echo "  ✓ feat(alb): add listener rule priority documentation"
                echo "  ✓ feat!: remove deprecated variables (breaking change)"
                echo ""
                echo "Your message:"
                echo "  $commit_msg"
                echo ""
                echo "See: https://www.conventionalcommits.org/"
                exit 1
            fi
            
            # Success - message is valid
            exit 0
        EOT
      + file                         = "./hooks/commit-msg"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-ci-cd"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-cloud-init"].github_repository_file.commit_msg_hook[0] will be created
  + resource "github_repository_file" "commit_msg_hook" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add commit-msg hook"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            #!/usr/bin/env bash
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            
            # Validates commit messages follow conventional commit format
            # See: https://www.conventionalcommits.org/
            
            set -e
            
            commit_msg_file=$1
            commit_msg=$(cat "$commit_msg_file")
            
            # Skip validation for merge commits
            if echo "$commit_msg" | grep -qE '^Merge (branch|pull request)'; then
                exit 0
            fi
            
            # Conventional commit pattern
            # Supports: type(scope): description or type: description
            # Types: feat, fix, docs, style, refactor, perf, test, build, ci, chore, revert, security
            # Optional ! for breaking changes: feat!: description
            pattern='^(feat|fix|docs|style|refactor|perf|test|build|ci|chore|revert|security)(\(.+\))?!?: .{1,}'
            
            if ! echo "$commit_msg" | grep -qE "$pattern"; then
                echo "❌ Invalid commit message format"
                echo ""
                echo "📝 Commit message must follow Conventional Commits:"
                echo ""
                echo "  <type>[optional scope][!]: <description>"
                echo ""
                echo "  [optional body]"
                echo ""
                echo "  [optional footer(s)]"
                echo ""
                echo "Types:"
                echo "  feat:     ✨ New feature"
                echo "  fix:      🐛 Bug fix"
                echo "  docs:     📚 Documentation changes"
                echo "  security: 🔒 Security improvements"
                echo "  refactor: ♻️  Code refactoring (no functional changes)"
                echo "  perf:     ⚡ Performance improvement"
                echo "  test:     ✅ Adding or updating tests"
                echo "  build:    🔧 Build system or dependency changes"
                echo "  ci:       👷 CI/CD configuration changes"
                echo "  chore:    🔨 Maintenance tasks"
                echo "  revert:   ⏪ Revert a previous commit"
                echo "  style:    💄 Code style changes (formatting, etc.)"
                echo ""
                echo "Breaking changes:"
                echo "  Use ! after type: feat!: breaking change description"
                echo ""
                echo "Examples:"
                echo "  ✓ feat: add deregistration delay configuration"
                echo "  ✓ fix: correct unhealthy threshold variable name"
                echo "  ✓ security: add S3 bucket encryption for access logs"
                echo "  ✓ docs: improve variable descriptions using HEREDOC"
                echo "  ✓ feat(alb): add listener rule priority documentation"
                echo "  ✓ feat!: remove deprecated variables (breaking change)"
                echo ""
                echo "Your message:"
                echo "  $commit_msg"
                echo ""
                echo "See: https://www.conventionalcommits.org/"
                exit 1
            fi
            
            # Success - message is valid
            exit 0
        EOT
      + file                         = "./hooks/commit-msg"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-cloud-init"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-cloudcraft-role"].github_repository_file.commit_msg_hook[0] will be created
  + resource "github_repository_file" "commit_msg_hook" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add commit-msg hook"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            #!/usr/bin/env bash
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            
            # Validates commit messages follow conventional commit format
            # See: https://www.conventionalcommits.org/
            
            set -e
            
            commit_msg_file=$1
            commit_msg=$(cat "$commit_msg_file")
            
            # Skip validation for merge commits
            if echo "$commit_msg" | grep -qE '^Merge (branch|pull request)'; then
                exit 0
            fi
            
            # Conventional commit pattern
            # Supports: type(scope): description or type: description
            # Types: feat, fix, docs, style, refactor, perf, test, build, ci, chore, revert, security
            # Optional ! for breaking changes: feat!: description
            pattern='^(feat|fix|docs|style|refactor|perf|test|build|ci|chore|revert|security)(\(.+\))?!?: .{1,}'
            
            if ! echo "$commit_msg" | grep -qE "$pattern"; then
                echo "❌ Invalid commit message format"
                echo ""
                echo "📝 Commit message must follow Conventional Commits:"
                echo ""
                echo "  <type>[optional scope][!]: <description>"
                echo ""
                echo "  [optional body]"
                echo ""
                echo "  [optional footer(s)]"
                echo ""
                echo "Types:"
                echo "  feat:     ✨ New feature"
                echo "  fix:      🐛 Bug fix"
                echo "  docs:     📚 Documentation changes"
                echo "  security: 🔒 Security improvements"
                echo "  refactor: ♻️  Code refactoring (no functional changes)"
                echo "  perf:     ⚡ Performance improvement"
                echo "  test:     ✅ Adding or updating tests"
                echo "  build:    🔧 Build system or dependency changes"
                echo "  ci:       👷 CI/CD configuration changes"
                echo "  chore:    🔨 Maintenance tasks"
                echo "  revert:   ⏪ Revert a previous commit"
                echo "  style:    💄 Code style changes (formatting, etc.)"
                echo ""
                echo "Breaking changes:"
                echo "  Use ! after type: feat!: breaking change description"
                echo ""
                echo "Examples:"
                echo "  ✓ feat: add deregistration delay configuration"
                echo "  ✓ fix: correct unhealthy threshold variable name"
                echo "  ✓ security: add S3 bucket encryption for access logs"
                echo "  ✓ docs: improve variable descriptions using HEREDOC"
                echo "  ✓ feat(alb): add listener rule priority documentation"
                echo "  ✓ feat!: remove deprecated variables (breaking change)"
                echo ""
                echo "Your message:"
                echo "  $commit_msg"
                echo ""
                echo "See: https://www.conventionalcommits.org/"
                exit 1
            fi
            
            # Success - message is valid
            exit 0
        EOT
      + file                         = "./hooks/commit-msg"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-cloudcraft-role"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-cost-alert"].github_repository_file.commit_msg_hook[0] will be created
  + resource "github_repository_file" "commit_msg_hook" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add commit-msg hook"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            #!/usr/bin/env bash
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            
            # Validates commit messages follow conventional commit format
            # See: https://www.conventionalcommits.org/
            
            set -e
            
            commit_msg_file=$1
            commit_msg=$(cat "$commit_msg_file")
            
            # Skip validation for merge commits
            if echo "$commit_msg" | grep -qE '^Merge (branch|pull request)'; then
                exit 0
            fi
            
            # Conventional commit pattern
            # Supports: type(scope): description or type: description
            # Types: feat, fix, docs, style, refactor, perf, test, build, ci, chore, revert, security
            # Optional ! for breaking changes: feat!: description
            pattern='^(feat|fix|docs|style|refactor|perf|test|build|ci|chore|revert|security)(\(.+\))?!?: .{1,}'
            
            if ! echo "$commit_msg" | grep -qE "$pattern"; then
                echo "❌ Invalid commit message format"
                echo ""
                echo "📝 Commit message must follow Conventional Commits:"
                echo ""
                echo "  <type>[optional scope][!]: <description>"
                echo ""
                echo "  [optional body]"
                echo ""
                echo "  [optional footer(s)]"
                echo ""
                echo "Types:"
                echo "  feat:     ✨ New feature"
                echo "  fix:      🐛 Bug fix"
                echo "  docs:     📚 Documentation changes"
                echo "  security: 🔒 Security improvements"
                echo "  refactor: ♻️  Code refactoring (no functional changes)"
                echo "  perf:     ⚡ Performance improvement"
                echo "  test:     ✅ Adding or updating tests"
                echo "  build:    🔧 Build system or dependency changes"
                echo "  ci:       👷 CI/CD configuration changes"
                echo "  chore:    🔨 Maintenance tasks"
                echo "  revert:   ⏪ Revert a previous commit"
                echo "  style:    💄 Code style changes (formatting, etc.)"
                echo ""
                echo "Breaking changes:"
                echo "  Use ! after type: feat!: breaking change description"
                echo ""
                echo "Examples:"
                echo "  ✓ feat: add deregistration delay configuration"
                echo "  ✓ fix: correct unhealthy threshold variable name"
                echo "  ✓ security: add S3 bucket encryption for access logs"
                echo "  ✓ docs: improve variable descriptions using HEREDOC"
                echo "  ✓ feat(alb): add listener rule priority documentation"
                echo "  ✓ feat!: remove deprecated variables (breaking change)"
                echo ""
                echo "Your message:"
                echo "  $commit_msg"
                echo ""
                echo "See: https://www.conventionalcommits.org/"
                exit 1
            fi
            
            # Success - message is valid
            exit 0
        EOT
      + file                         = "./hooks/commit-msg"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-cost-alert"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-debian-repo"].github_repository_file.commit_msg_hook[0] will be created
  + resource "github_repository_file" "commit_msg_hook" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add commit-msg hook"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            #!/usr/bin/env bash
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            
            # Validates commit messages follow conventional commit format
            # See: https://www.conventionalcommits.org/
            
            set -e
            
            commit_msg_file=$1
            commit_msg=$(cat "$commit_msg_file")
            
            # Skip validation for merge commits
            if echo "$commit_msg" | grep -qE '^Merge (branch|pull request)'; then
                exit 0
            fi
            
            # Conventional commit pattern
            # Supports: type(scope): description or type: description
            # Types: feat, fix, docs, style, refactor, perf, test, build, ci, chore, revert, security
            # Optional ! for breaking changes: feat!: description
            pattern='^(feat|fix|docs|style|refactor|perf|test|build|ci|chore|revert|security)(\(.+\))?!?: .{1,}'
            
            if ! echo "$commit_msg" | grep -qE "$pattern"; then
                echo "❌ Invalid commit message format"
                echo ""
                echo "📝 Commit message must follow Conventional Commits:"
                echo ""
                echo "  <type>[optional scope][!]: <description>"
                echo ""
                echo "  [optional body]"
                echo ""
                echo "  [optional footer(s)]"
                echo ""
                echo "Types:"
                echo "  feat:     ✨ New feature"
                echo "  fix:      🐛 Bug fix"
                echo "  docs:     📚 Documentation changes"
                echo "  security: 🔒 Security improvements"
                echo "  refactor: ♻️  Code refactoring (no functional changes)"
                echo "  perf:     ⚡ Performance improvement"
                echo "  test:     ✅ Adding or updating tests"
                echo "  build:    🔧 Build system or dependency changes"
                echo "  ci:       👷 CI/CD configuration changes"
                echo "  chore:    🔨 Maintenance tasks"
                echo "  revert:   ⏪ Revert a previous commit"
                echo "  style:    💄 Code style changes (formatting, etc.)"
                echo ""
                echo "Breaking changes:"
                echo "  Use ! after type: feat!: breaking change description"
                echo ""
                echo "Examples:"
                echo "  ✓ feat: add deregistration delay configuration"
                echo "  ✓ fix: correct unhealthy threshold variable name"
                echo "  ✓ security: add S3 bucket encryption for access logs"
                echo "  ✓ docs: improve variable descriptions using HEREDOC"
                echo "  ✓ feat(alb): add listener rule priority documentation"
                echo "  ✓ feat!: remove deprecated variables (breaking change)"
                echo ""
                echo "Your message:"
                echo "  $commit_msg"
                echo ""
                echo "See: https://www.conventionalcommits.org/"
                exit 1
            fi
            
            # Success - message is valid
            exit 0
        EOT
      + file                         = "./hooks/commit-msg"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-debian-repo"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-dms"].github_repository_file.commit_msg_hook[0] will be created
  + resource "github_repository_file" "commit_msg_hook" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add commit-msg hook"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            #!/usr/bin/env bash
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            
            # Validates commit messages follow conventional commit format
            # See: https://www.conventionalcommits.org/
            
            set -e
            
            commit_msg_file=$1
            commit_msg=$(cat "$commit_msg_file")
            
            # Skip validation for merge commits
            if echo "$commit_msg" | grep -qE '^Merge (branch|pull request)'; then
                exit 0
            fi
            
            # Conventional commit pattern
            # Supports: type(scope): description or type: description
            # Types: feat, fix, docs, style, refactor, perf, test, build, ci, chore, revert, security
            # Optional ! for breaking changes: feat!: description
            pattern='^(feat|fix|docs|style|refactor|perf|test|build|ci|chore|revert|security)(\(.+\))?!?: .{1,}'
            
            if ! echo "$commit_msg" | grep -qE "$pattern"; then
                echo "❌ Invalid commit message format"
                echo ""
                echo "📝 Commit message must follow Conventional Commits:"
                echo ""
                echo "  <type>[optional scope][!]: <description>"
                echo ""
                echo "  [optional body]"
                echo ""
                echo "  [optional footer(s)]"
                echo ""
                echo "Types:"
                echo "  feat:     ✨ New feature"
                echo "  fix:      🐛 Bug fix"
                echo "  docs:     📚 Documentation changes"
                echo "  security: 🔒 Security improvements"
                echo "  refactor: ♻️  Code refactoring (no functional changes)"
                echo "  perf:     ⚡ Performance improvement"
                echo "  test:     ✅ Adding or updating tests"
                echo "  build:    🔧 Build system or dependency changes"
                echo "  ci:       👷 CI/CD configuration changes"
                echo "  chore:    🔨 Maintenance tasks"
                echo "  revert:   ⏪ Revert a previous commit"
                echo "  style:    💄 Code style changes (formatting, etc.)"
                echo ""
                echo "Breaking changes:"
                echo "  Use ! after type: feat!: breaking change description"
                echo ""
                echo "Examples:"
                echo "  ✓ feat: add deregistration delay configuration"
                echo "  ✓ fix: correct unhealthy threshold variable name"
                echo "  ✓ security: add S3 bucket encryption for access logs"
                echo "  ✓ docs: improve variable descriptions using HEREDOC"
                echo "  ✓ feat(alb): add listener rule priority documentation"
                echo "  ✓ feat!: remove deprecated variables (breaking change)"
                echo ""
                echo "Your message:"
                echo "  $commit_msg"
                echo ""
                echo "See: https://www.conventionalcommits.org/"
                exit 1
            fi
            
            # Success - message is valid
            exit 0
        EOT
      + file                         = "./hooks/commit-msg"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-dms"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-ecr"].github_repository_file.commit_msg_hook[0] will be created
  + resource "github_repository_file" "commit_msg_hook" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add commit-msg hook"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            #!/usr/bin/env bash
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            
            # Validates commit messages follow conventional commit format
            # See: https://www.conventionalcommits.org/
            
            set -e
            
            commit_msg_file=$1
            commit_msg=$(cat "$commit_msg_file")
            
            # Skip validation for merge commits
            if echo "$commit_msg" | grep -qE '^Merge (branch|pull request)'; then
                exit 0
            fi
            
            # Conventional commit pattern
            # Supports: type(scope): description or type: description
            # Types: feat, fix, docs, style, refactor, perf, test, build, ci, chore, revert, security
            # Optional ! for breaking changes: feat!: description
            pattern='^(feat|fix|docs|style|refactor|perf|test|build|ci|chore|revert|security)(\(.+\))?!?: .{1,}'
            
            if ! echo "$commit_msg" | grep -qE "$pattern"; then
                echo "❌ Invalid commit message format"
                echo ""
                echo "📝 Commit message must follow Conventional Commits:"
                echo ""
                echo "  <type>[optional scope][!]: <description>"
                echo ""
                echo "  [optional body]"
                echo ""
                echo "  [optional footer(s)]"
                echo ""
                echo "Types:"
                echo "  feat:     ✨ New feature"
                echo "  fix:      🐛 Bug fix"
                echo "  docs:     📚 Documentation changes"
                echo "  security: 🔒 Security improvements"
                echo "  refactor: ♻️  Code refactoring (no functional changes)"
                echo "  perf:     ⚡ Performance improvement"
                echo "  test:     ✅ Adding or updating tests"
                echo "  build:    🔧 Build system or dependency changes"
                echo "  ci:       👷 CI/CD configuration changes"
                echo "  chore:    🔨 Maintenance tasks"
                echo "  revert:   ⏪ Revert a previous commit"
                echo "  style:    💄 Code style changes (formatting, etc.)"
                echo ""
                echo "Breaking changes:"
                echo "  Use ! after type: feat!: breaking change description"
                echo ""
                echo "Examples:"
                echo "  ✓ feat: add deregistration delay configuration"
                echo "  ✓ fix: correct unhealthy threshold variable name"
                echo "  ✓ security: add S3 bucket encryption for access logs"
                echo "  ✓ docs: improve variable descriptions using HEREDOC"
                echo "  ✓ feat(alb): add listener rule priority documentation"
                echo "  ✓ feat!: remove deprecated variables (breaking change)"
                echo ""
                echo "Your message:"
                echo "  $commit_msg"
                echo ""
                echo "See: https://www.conventionalcommits.org/"
                exit 1
            fi
            
            # Success - message is valid
            exit 0
        EOT
      + file                         = "./hooks/commit-msg"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-ecr"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-ecs"].github_repository_file.commit_msg_hook[0] will be created
  + resource "github_repository_file" "commit_msg_hook" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add commit-msg hook"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            #!/usr/bin/env bash
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            
            # Validates commit messages follow conventional commit format
            # See: https://www.conventionalcommits.org/
            
            set -e
            
            commit_msg_file=$1
            commit_msg=$(cat "$commit_msg_file")
            
            # Skip validation for merge commits
            if echo "$commit_msg" | grep -qE '^Merge (branch|pull request)'; then
                exit 0
            fi
            
            # Conventional commit pattern
            # Supports: type(scope): description or type: description
            # Types: feat, fix, docs, style, refactor, perf, test, build, ci, chore, revert, security
            # Optional ! for breaking changes: feat!: description
            pattern='^(feat|fix|docs|style|refactor|perf|test|build|ci|chore|revert|security)(\(.+\))?!?: .{1,}'
            
            if ! echo "$commit_msg" | grep -qE "$pattern"; then
                echo "❌ Invalid commit message format"
                echo ""
                echo "📝 Commit message must follow Conventional Commits:"
                echo ""
                echo "  <type>[optional scope][!]: <description>"
                echo ""
                echo "  [optional body]"
                echo ""
                echo "  [optional footer(s)]"
                echo ""
                echo "Types:"
                echo "  feat:     ✨ New feature"
                echo "  fix:      🐛 Bug fix"
                echo "  docs:     📚 Documentation changes"
                echo "  security: 🔒 Security improvements"
                echo "  refactor: ♻️  Code refactoring (no functional changes)"
                echo "  perf:     ⚡ Performance improvement"
                echo "  test:     ✅ Adding or updating tests"
                echo "  build:    🔧 Build system or dependency changes"
                echo "  ci:       👷 CI/CD configuration changes"
                echo "  chore:    🔨 Maintenance tasks"
                echo "  revert:   ⏪ Revert a previous commit"
                echo "  style:    💄 Code style changes (formatting, etc.)"
                echo ""
                echo "Breaking changes:"
                echo "  Use ! after type: feat!: breaking change description"
                echo ""
                echo "Examples:"
                echo "  ✓ feat: add deregistration delay configuration"
                echo "  ✓ fix: correct unhealthy threshold variable name"
                echo "  ✓ security: add S3 bucket encryption for access logs"
                echo "  ✓ docs: improve variable descriptions using HEREDOC"
                echo "  ✓ feat(alb): add listener rule priority documentation"
                echo "  ✓ feat!: remove deprecated variables (breaking change)"
                echo ""
                echo "Your message:"
                echo "  $commit_msg"
                echo ""
                echo "See: https://www.conventionalcommits.org/"
                exit 1
            fi
            
            # Success - message is valid
            exit 0
        EOT
      + file                         = "./hooks/commit-msg"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-ecs"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-elasticsearch"].github_repository_file.commit_msg_hook[0] will be created
  + resource "github_repository_file" "commit_msg_hook" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add commit-msg hook"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            #!/usr/bin/env bash
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            
            # Validates commit messages follow conventional commit format
            # See: https://www.conventionalcommits.org/
            
            set -e
            
            commit_msg_file=$1
            commit_msg=$(cat "$commit_msg_file")
            
            # Skip validation for merge commits
            if echo "$commit_msg" | grep -qE '^Merge (branch|pull request)'; then
                exit 0
            fi
            
            # Conventional commit pattern
            # Supports: type(scope): description or type: description
            # Types: feat, fix, docs, style, refactor, perf, test, build, ci, chore, revert, security
            # Optional ! for breaking changes: feat!: description
            pattern='^(feat|fix|docs|style|refactor|perf|test|build|ci|chore|revert|security)(\(.+\))?!?: .{1,}'
            
            if ! echo "$commit_msg" | grep -qE "$pattern"; then
                echo "❌ Invalid commit message format"
                echo ""
                echo "📝 Commit message must follow Conventional Commits:"
                echo ""
                echo "  <type>[optional scope][!]: <description>"
                echo ""
                echo "  [optional body]"
                echo ""
                echo "  [optional footer(s)]"
                echo ""
                echo "Types:"
                echo "  feat:     ✨ New feature"
                echo "  fix:      🐛 Bug fix"
                echo "  docs:     📚 Documentation changes"
                echo "  security: 🔒 Security improvements"
                echo "  refactor: ♻️  Code refactoring (no functional changes)"
                echo "  perf:     ⚡ Performance improvement"
                echo "  test:     ✅ Adding or updating tests"
                echo "  build:    🔧 Build system or dependency changes"
                echo "  ci:       👷 CI/CD configuration changes"
                echo "  chore:    🔨 Maintenance tasks"
                echo "  revert:   ⏪ Revert a previous commit"
                echo "  style:    💄 Code style changes (formatting, etc.)"
                echo ""
                echo "Breaking changes:"
                echo "  Use ! after type: feat!: breaking change description"
                echo ""
                echo "Examples:"
                echo "  ✓ feat: add deregistration delay configuration"
                echo "  ✓ fix: correct unhealthy threshold variable name"
                echo "  ✓ security: add S3 bucket encryption for access logs"
                echo "  ✓ docs: improve variable descriptions using HEREDOC"
                echo "  ✓ feat(alb): add listener rule priority documentation"
                echo "  ✓ feat!: remove deprecated variables (breaking change)"
                echo ""
                echo "Your message:"
                echo "  $commit_msg"
                echo ""
                echo "See: https://www.conventionalcommits.org/"
                exit 1
            fi
            
            # Success - message is valid
            exit 0
        EOT
      + file                         = "./hooks/commit-msg"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-elasticsearch"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-emrserverless"].github_repository_file.commit_msg_hook[0] will be created
  + resource "github_repository_file" "commit_msg_hook" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add commit-msg hook"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            #!/usr/bin/env bash
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            
            # Validates commit messages follow conventional commit format
            # See: https://www.conventionalcommits.org/
            
            set -e
            
            commit_msg_file=$1
            commit_msg=$(cat "$commit_msg_file")
            
            # Skip validation for merge commits
            if echo "$commit_msg" | grep -qE '^Merge (branch|pull request)'; then
                exit 0
            fi
            
            # Conventional commit pattern
            # Supports: type(scope): description or type: description
            # Types: feat, fix, docs, style, refactor, perf, test, build, ci, chore, revert, security
            # Optional ! for breaking changes: feat!: description
            pattern='^(feat|fix|docs|style|refactor|perf|test|build|ci|chore|revert|security)(\(.+\))?!?: .{1,}'
            
            if ! echo "$commit_msg" | grep -qE "$pattern"; then
                echo "❌ Invalid commit message format"
                echo ""
                echo "📝 Commit message must follow Conventional Commits:"
                echo ""
                echo "  <type>[optional scope][!]: <description>"
                echo ""
                echo "  [optional body]"
                echo ""
                echo "  [optional footer(s)]"
                echo ""
                echo "Types:"
                echo "  feat:     ✨ New feature"
                echo "  fix:      🐛 Bug fix"
                echo "  docs:     📚 Documentation changes"
                echo "  security: 🔒 Security improvements"
                echo "  refactor: ♻️  Code refactoring (no functional changes)"
                echo "  perf:     ⚡ Performance improvement"
                echo "  test:     ✅ Adding or updating tests"
                echo "  build:    🔧 Build system or dependency changes"
                echo "  ci:       👷 CI/CD configuration changes"
                echo "  chore:    🔨 Maintenance tasks"
                echo "  revert:   ⏪ Revert a previous commit"
                echo "  style:    💄 Code style changes (formatting, etc.)"
                echo ""
                echo "Breaking changes:"
                echo "  Use ! after type: feat!: breaking change description"
                echo ""
                echo "Examples:"
                echo "  ✓ feat: add deregistration delay configuration"
                echo "  ✓ fix: correct unhealthy threshold variable name"
                echo "  ✓ security: add S3 bucket encryption for access logs"
                echo "  ✓ docs: improve variable descriptions using HEREDOC"
                echo "  ✓ feat(alb): add listener rule priority documentation"
                echo "  ✓ feat!: remove deprecated variables (breaking change)"
                echo ""
                echo "Your message:"
                echo "  $commit_msg"
                echo ""
                echo "See: https://www.conventionalcommits.org/"
                exit 1
            fi
            
            # Success - message is valid
            exit 0
        EOT
      + file                         = "./hooks/commit-msg"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-emrserverless"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-gh-identity-provider"].github_repository_file.commit_msg_hook[0] will be created
  + resource "github_repository_file" "commit_msg_hook" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add commit-msg hook"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            #!/usr/bin/env bash
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            
            # Validates commit messages follow conventional commit format
            # See: https://www.conventionalcommits.org/
            
            set -e
            
            commit_msg_file=$1
            commit_msg=$(cat "$commit_msg_file")
            
            # Skip validation for merge commits
            if echo "$commit_msg" | grep -qE '^Merge (branch|pull request)'; then
                exit 0
            fi
            
            # Conventional commit pattern
            # Supports: type(scope): description or type: description
            # Types: feat, fix, docs, style, refactor, perf, test, build, ci, chore, revert, security
            # Optional ! for breaking changes: feat!: description
            pattern='^(feat|fix|docs|style|refactor|perf|test|build|ci|chore|revert|security)(\(.+\))?!?: .{1,}'
            
            if ! echo "$commit_msg" | grep -qE "$pattern"; then
                echo "❌ Invalid commit message format"
                echo ""
                echo "📝 Commit message must follow Conventional Commits:"
                echo ""
                echo "  <type>[optional scope][!]: <description>"
                echo ""
                echo "  [optional body]"
                echo ""
                echo "  [optional footer(s)]"
                echo ""
                echo "Types:"
                echo "  feat:     ✨ New feature"
                echo "  fix:      🐛 Bug fix"
                echo "  docs:     📚 Documentation changes"
                echo "  security: 🔒 Security improvements"
                echo "  refactor: ♻️  Code refactoring (no functional changes)"
                echo "  perf:     ⚡ Performance improvement"
                echo "  test:     ✅ Adding or updating tests"
                echo "  build:    🔧 Build system or dependency changes"
                echo "  ci:       👷 CI/CD configuration changes"
                echo "  chore:    🔨 Maintenance tasks"
                echo "  revert:   ⏪ Revert a previous commit"
                echo "  style:    💄 Code style changes (formatting, etc.)"
                echo ""
                echo "Breaking changes:"
                echo "  Use ! after type: feat!: breaking change description"
                echo ""
                echo "Examples:"
                echo "  ✓ feat: add deregistration delay configuration"
                echo "  ✓ fix: correct unhealthy threshold variable name"
                echo "  ✓ security: add S3 bucket encryption for access logs"
                echo "  ✓ docs: improve variable descriptions using HEREDOC"
                echo "  ✓ feat(alb): add listener rule priority documentation"
                echo "  ✓ feat!: remove deprecated variables (breaking change)"
                echo ""
                echo "Your message:"
                echo "  $commit_msg"
                echo ""
                echo "See: https://www.conventionalcommits.org/"
                exit 1
            fi
            
            # Success - message is valid
            exit 0
        EOT
      + file                         = "./hooks/commit-msg"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-gh-identity-provider"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-gha-admin"].github_repository_file.commit_msg_hook[0] will be created
  + resource "github_repository_file" "commit_msg_hook" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add commit-msg hook"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            #!/usr/bin/env bash
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            
            # Validates commit messages follow conventional commit format
            # See: https://www.conventionalcommits.org/
            
            set -e
            
            commit_msg_file=$1
            commit_msg=$(cat "$commit_msg_file")
            
            # Skip validation for merge commits
            if echo "$commit_msg" | grep -qE '^Merge (branch|pull request)'; then
                exit 0
            fi
            
            # Conventional commit pattern
            # Supports: type(scope): description or type: description
            # Types: feat, fix, docs, style, refactor, perf, test, build, ci, chore, revert, security
            # Optional ! for breaking changes: feat!: description
            pattern='^(feat|fix|docs|style|refactor|perf|test|build|ci|chore|revert|security)(\(.+\))?!?: .{1,}'
            
            if ! echo "$commit_msg" | grep -qE "$pattern"; then
                echo "❌ Invalid commit message format"
                echo ""
                echo "📝 Commit message must follow Conventional Commits:"
                echo ""
                echo "  <type>[optional scope][!]: <description>"
                echo ""
                echo "  [optional body]"
                echo ""
                echo "  [optional footer(s)]"
                echo ""
                echo "Types:"
                echo "  feat:     ✨ New feature"
                echo "  fix:      🐛 Bug fix"
                echo "  docs:     📚 Documentation changes"
                echo "  security: 🔒 Security improvements"
                echo "  refactor: ♻️  Code refactoring (no functional changes)"
                echo "  perf:     ⚡ Performance improvement"
                echo "  test:     ✅ Adding or updating tests"
                echo "  build:    🔧 Build system or dependency changes"
                echo "  ci:       👷 CI/CD configuration changes"
                echo "  chore:    🔨 Maintenance tasks"
                echo "  revert:   ⏪ Revert a previous commit"
                echo "  style:    💄 Code style changes (formatting, etc.)"
                echo ""
                echo "Breaking changes:"
                echo "  Use ! after type: feat!: breaking change description"
                echo ""
                echo "Examples:"
                echo "  ✓ feat: add deregistration delay configuration"
                echo "  ✓ fix: correct unhealthy threshold variable name"
                echo "  ✓ security: add S3 bucket encryption for access logs"
                echo "  ✓ docs: improve variable descriptions using HEREDOC"
                echo "  ✓ feat(alb): add listener rule priority documentation"
                echo "  ✓ feat!: remove deprecated variables (breaking change)"
                echo ""
                echo "Your message:"
                echo "  $commit_msg"
                echo ""
                echo "See: https://www.conventionalcommits.org/"
                exit 1
            fi
            
            # Success - message is valid
            exit 0
        EOT
      + file                         = "./hooks/commit-msg"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-gha-admin"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-github-backup"].github_repository_file.commit_msg_hook[0] will be created
  + resource "github_repository_file" "commit_msg_hook" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add commit-msg hook"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            #!/usr/bin/env bash
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            
            # Validates commit messages follow conventional commit format
            # See: https://www.conventionalcommits.org/
            
            set -e
            
            commit_msg_file=$1
            commit_msg=$(cat "$commit_msg_file")
            
            # Skip validation for merge commits
            if echo "$commit_msg" | grep -qE '^Merge (branch|pull request)'; then
                exit 0
            fi
            
            # Conventional commit pattern
            # Supports: type(scope): description or type: description
            # Types: feat, fix, docs, style, refactor, perf, test, build, ci, chore, revert, security
            # Optional ! for breaking changes: feat!: description
            pattern='^(feat|fix|docs|style|refactor|perf|test|build|ci|chore|revert|security)(\(.+\))?!?: .{1,}'
            
            if ! echo "$commit_msg" | grep -qE "$pattern"; then
                echo "❌ Invalid commit message format"
                echo ""
                echo "📝 Commit message must follow Conventional Commits:"
                echo ""
                echo "  <type>[optional scope][!]: <description>"
                echo ""
                echo "  [optional body]"
                echo ""
                echo "  [optional footer(s)]"
                echo ""
                echo "Types:"
                echo "  feat:     ✨ New feature"
                echo "  fix:      🐛 Bug fix"
                echo "  docs:     📚 Documentation changes"
                echo "  security: 🔒 Security improvements"
                echo "  refactor: ♻️  Code refactoring (no functional changes)"
                echo "  perf:     ⚡ Performance improvement"
                echo "  test:     ✅ Adding or updating tests"
                echo "  build:    🔧 Build system or dependency changes"
                echo "  ci:       👷 CI/CD configuration changes"
                echo "  chore:    🔨 Maintenance tasks"
                echo "  revert:   ⏪ Revert a previous commit"
                echo "  style:    💄 Code style changes (formatting, etc.)"
                echo ""
                echo "Breaking changes:"
                echo "  Use ! after type: feat!: breaking change description"
                echo ""
                echo "Examples:"
                echo "  ✓ feat: add deregistration delay configuration"
                echo "  ✓ fix: correct unhealthy threshold variable name"
                echo "  ✓ security: add S3 bucket encryption for access logs"
                echo "  ✓ docs: improve variable descriptions using HEREDOC"
                echo "  ✓ feat(alb): add listener rule priority documentation"
                echo "  ✓ feat!: remove deprecated variables (breaking change)"
                echo ""
                echo "Your message:"
                echo "  $commit_msg"
                echo ""
                echo "See: https://www.conventionalcommits.org/"
                exit 1
            fi
            
            # Success - message is valid
            exit 0
        EOT
      + file                         = "./hooks/commit-msg"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-github-backup"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-github-backup-configuration"].github_repository_file.commit_msg_hook[0] will be created
  + resource "github_repository_file" "commit_msg_hook" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add commit-msg hook"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            #!/usr/bin/env bash
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            
            # Validates commit messages follow conventional commit format
            # See: https://www.conventionalcommits.org/
            
            set -e
            
            commit_msg_file=$1
            commit_msg=$(cat "$commit_msg_file")
            
            # Skip validation for merge commits
            if echo "$commit_msg" | grep -qE '^Merge (branch|pull request)'; then
                exit 0
            fi
            
            # Conventional commit pattern
            # Supports: type(scope): description or type: description
            # Types: feat, fix, docs, style, refactor, perf, test, build, ci, chore, revert, security
            # Optional ! for breaking changes: feat!: description
            pattern='^(feat|fix|docs|style|refactor|perf|test|build|ci|chore|revert|security)(\(.+\))?!?: .{1,}'
            
            if ! echo "$commit_msg" | grep -qE "$pattern"; then
                echo "❌ Invalid commit message format"
                echo ""
                echo "📝 Commit message must follow Conventional Commits:"
                echo ""
                echo "  <type>[optional scope][!]: <description>"
                echo ""
                echo "  [optional body]"
                echo ""
                echo "  [optional footer(s)]"
                echo ""
                echo "Types:"
                echo "  feat:     ✨ New feature"
                echo "  fix:      🐛 Bug fix"
                echo "  docs:     📚 Documentation changes"
                echo "  security: 🔒 Security improvements"
                echo "  refactor: ♻️  Code refactoring (no functional changes)"
                echo "  perf:     ⚡ Performance improvement"
                echo "  test:     ✅ Adding or updating tests"
                echo "  build:    🔧 Build system or dependency changes"
                echo "  ci:       👷 CI/CD configuration changes"
                echo "  chore:    🔨 Maintenance tasks"
                echo "  revert:   ⏪ Revert a previous commit"
                echo "  style:    💄 Code style changes (formatting, etc.)"
                echo ""
                echo "Breaking changes:"
                echo "  Use ! after type: feat!: breaking change description"
                echo ""
                echo "Examples:"
                echo "  ✓ feat: add deregistration delay configuration"
                echo "  ✓ fix: correct unhealthy threshold variable name"
                echo "  ✓ security: add S3 bucket encryption for access logs"
                echo "  ✓ docs: improve variable descriptions using HEREDOC"
                echo "  ✓ feat(alb): add listener rule priority documentation"
                echo "  ✓ feat!: remove deprecated variables (breaking change)"
                echo ""
                echo "Your message:"
                echo "  $commit_msg"
                echo ""
                echo "See: https://www.conventionalcommits.org/"
                exit 1
            fi
            
            # Success - message is valid
            exit 0
        EOT
      + file                         = "./hooks/commit-msg"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-github-backup-configuration"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-github-role"].github_repository_file.commit_msg_hook[0] will be created
  + resource "github_repository_file" "commit_msg_hook" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add commit-msg hook"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            #!/usr/bin/env bash
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            
            # Validates commit messages follow conventional commit format
            # See: https://www.conventionalcommits.org/
            
            set -e
            
            commit_msg_file=$1
            commit_msg=$(cat "$commit_msg_file")
            
            # Skip validation for merge commits
            if echo "$commit_msg" | grep -qE '^Merge (branch|pull request)'; then
                exit 0
            fi
            
            # Conventional commit pattern
            # Supports: type(scope): description or type: description
            # Types: feat, fix, docs, style, refactor, perf, test, build, ci, chore, revert, security
            # Optional ! for breaking changes: feat!: description
            pattern='^(feat|fix|docs|style|refactor|perf|test|build|ci|chore|revert|security)(\(.+\))?!?: .{1,}'
            
            if ! echo "$commit_msg" | grep -qE "$pattern"; then
                echo "❌ Invalid commit message format"
                echo ""
                echo "📝 Commit message must follow Conventional Commits:"
                echo ""
                echo "  <type>[optional scope][!]: <description>"
                echo ""
                echo "  [optional body]"
                echo ""
                echo "  [optional footer(s)]"
                echo ""
                echo "Types:"
                echo "  feat:     ✨ New feature"
                echo "  fix:      🐛 Bug fix"
                echo "  docs:     📚 Documentation changes"
                echo "  security: 🔒 Security improvements"
                echo "  refactor: ♻️  Code refactoring (no functional changes)"
                echo "  perf:     ⚡ Performance improvement"
                echo "  test:     ✅ Adding or updating tests"
                echo "  build:    🔧 Build system or dependency changes"
                echo "  ci:       👷 CI/CD configuration changes"
                echo "  chore:    🔨 Maintenance tasks"
                echo "  revert:   ⏪ Revert a previous commit"
                echo "  style:    💄 Code style changes (formatting, etc.)"
                echo ""
                echo "Breaking changes:"
                echo "  Use ! after type: feat!: breaking change description"
                echo ""
                echo "Examples:"
                echo "  ✓ feat: add deregistration delay configuration"
                echo "  ✓ fix: correct unhealthy threshold variable name"
                echo "  ✓ security: add S3 bucket encryption for access logs"
                echo "  ✓ docs: improve variable descriptions using HEREDOC"
                echo "  ✓ feat(alb): add listener rule priority documentation"
                echo "  ✓ feat!: remove deprecated variables (breaking change)"
                echo ""
                echo "Your message:"
                echo "  $commit_msg"
                echo ""
                echo "See: https://www.conventionalcommits.org/"
                exit 1
            fi
            
            # Success - message is valid
            exit 0
        EOT
      + file                         = "./hooks/commit-msg"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-github-role"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-guardduty-configuration"].github_repository_file.commit_msg_hook[0] will be created
  + resource "github_repository_file" "commit_msg_hook" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add commit-msg hook"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            #!/usr/bin/env bash
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            
            # Validates commit messages follow conventional commit format
            # See: https://www.conventionalcommits.org/
            
            set -e
            
            commit_msg_file=$1
            commit_msg=$(cat "$commit_msg_file")
            
            # Skip validation for merge commits
            if echo "$commit_msg" | grep -qE '^Merge (branch|pull request)'; then
                exit 0
            fi
            
            # Conventional commit pattern
            # Supports: type(scope): description or type: description
            # Types: feat, fix, docs, style, refactor, perf, test, build, ci, chore, revert, security
            # Optional ! for breaking changes: feat!: description
            pattern='^(feat|fix|docs|style|refactor|perf|test|build|ci|chore|revert|security)(\(.+\))?!?: .{1,}'
            
            if ! echo "$commit_msg" | grep -qE "$pattern"; then
                echo "❌ Invalid commit message format"
                echo ""
                echo "📝 Commit message must follow Conventional Commits:"
                echo ""
                echo "  <type>[optional scope][!]: <description>"
                echo ""
                echo "  [optional body]"
                echo ""
                echo "  [optional footer(s)]"
                echo ""
                echo "Types:"
                echo "  feat:     ✨ New feature"
                echo "  fix:      🐛 Bug fix"
                echo "  docs:     📚 Documentation changes"
                echo "  security: 🔒 Security improvements"
                echo "  refactor: ♻️  Code refactoring (no functional changes)"
                echo "  perf:     ⚡ Performance improvement"
                echo "  test:     ✅ Adding or updating tests"
                echo "  build:    🔧 Build system or dependency changes"
                echo "  ci:       👷 CI/CD configuration changes"
                echo "  chore:    🔨 Maintenance tasks"
                echo "  revert:   ⏪ Revert a previous commit"
                echo "  style:    💄 Code style changes (formatting, etc.)"
                echo ""
                echo "Breaking changes:"
                echo "  Use ! after type: feat!: breaking change description"
                echo ""
                echo "Examples:"
                echo "  ✓ feat: add deregistration delay configuration"
                echo "  ✓ fix: correct unhealthy threshold variable name"
                echo "  ✓ security: add S3 bucket encryption for access logs"
                echo "  ✓ docs: improve variable descriptions using HEREDOC"
                echo "  ✓ feat(alb): add listener rule priority documentation"
                echo "  ✓ feat!: remove deprecated variables (breaking change)"
                echo ""
                echo "Your message:"
                echo "  $commit_msg"
                echo ""
                echo "See: https://www.conventionalcommits.org/"
                exit 1
            fi
            
            # Success - message is valid
            exit 0
        EOT
      + file                         = "./hooks/commit-msg"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-guardduty-configuration"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-http-redirect"].github_repository_file.commit_msg_hook[0] will be created
  + resource "github_repository_file" "commit_msg_hook" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add commit-msg hook"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            #!/usr/bin/env bash
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            
            # Validates commit messages follow conventional commit format
            # See: https://www.conventionalcommits.org/
            
            set -e
            
            commit_msg_file=$1
            commit_msg=$(cat "$commit_msg_file")
            
            # Skip validation for merge commits
            if echo "$commit_msg" | grep -qE '^Merge (branch|pull request)'; then
                exit 0
            fi
            
            # Conventional commit pattern
            # Supports: type(scope): description or type: description
            # Types: feat, fix, docs, style, refactor, perf, test, build, ci, chore, revert, security
            # Optional ! for breaking changes: feat!: description
            pattern='^(feat|fix|docs|style|refactor|perf|test|build|ci|chore|revert|security)(\(.+\))?!?: .{1,}'
            
            if ! echo "$commit_msg" | grep -qE "$pattern"; then
                echo "❌ Invalid commit message format"
                echo ""
                echo "📝 Commit message must follow Conventional Commits:"
                echo ""
                echo "  <type>[optional scope][!]: <description>"
                echo ""
                echo "  [optional body]"
                echo ""
                echo "  [optional footer(s)]"
                echo ""
                echo "Types:"
                echo "  feat:     ✨ New feature"
                echo "  fix:      🐛 Bug fix"
                echo "  docs:     📚 Documentation changes"
                echo "  security: 🔒 Security improvements"
                echo "  refactor: ♻️  Code refactoring (no functional changes)"
                echo "  perf:     ⚡ Performance improvement"
                echo "  test:     ✅ Adding or updating tests"
                echo "  build:    🔧 Build system or dependency changes"
                echo "  ci:       👷 CI/CD configuration changes"
                echo "  chore:    🔨 Maintenance tasks"
                echo "  revert:   ⏪ Revert a previous commit"
                echo "  style:    💄 Code style changes (formatting, etc.)"
                echo ""
                echo "Breaking changes:"
                echo "  Use ! after type: feat!: breaking change description"
                echo ""
                echo "Examples:"
                echo "  ✓ feat: add deregistration delay configuration"
                echo "  ✓ fix: correct unhealthy threshold variable name"
                echo "  ✓ security: add S3 bucket encryption for access logs"
                echo "  ✓ docs: improve variable descriptions using HEREDOC"
                echo "  ✓ feat(alb): add listener rule priority documentation"
                echo "  ✓ feat!: remove deprecated variables (breaking change)"
                echo ""
                echo "Your message:"
                echo "  $commit_msg"
                echo ""
                echo "See: https://www.conventionalcommits.org/"
                exit 1
            fi
            
            # Success - message is valid
            exit 0
        EOT
      + file                         = "./hooks/commit-msg"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-http-redirect"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-instance-profile"].github_repository_file.commit_msg_hook[0] will be created
  + resource "github_repository_file" "commit_msg_hook" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add commit-msg hook"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            #!/usr/bin/env bash
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            
            # Validates commit messages follow conventional commit format
            # See: https://www.conventionalcommits.org/
            
            set -e
            
            commit_msg_file=$1
            commit_msg=$(cat "$commit_msg_file")
            
            # Skip validation for merge commits
            if echo "$commit_msg" | grep -qE '^Merge (branch|pull request)'; then
                exit 0
            fi
            
            # Conventional commit pattern
            # Supports: type(scope): description or type: description
            # Types: feat, fix, docs, style, refactor, perf, test, build, ci, chore, revert, security
            # Optional ! for breaking changes: feat!: description
            pattern='^(feat|fix|docs|style|refactor|perf|test|build|ci|chore|revert|security)(\(.+\))?!?: .{1,}'
            
            if ! echo "$commit_msg" | grep -qE "$pattern"; then
                echo "❌ Invalid commit message format"
                echo ""
                echo "📝 Commit message must follow Conventional Commits:"
                echo ""
                echo "  <type>[optional scope][!]: <description>"
                echo ""
                echo "  [optional body]"
                echo ""
                echo "  [optional footer(s)]"
                echo ""
                echo "Types:"
                echo "  feat:     ✨ New feature"
                echo "  fix:      🐛 Bug fix"
                echo "  docs:     📚 Documentation changes"
                echo "  security: 🔒 Security improvements"
                echo "  refactor: ♻️  Code refactoring (no functional changes)"
                echo "  perf:     ⚡ Performance improvement"
                echo "  test:     ✅ Adding or updating tests"
                echo "  build:    🔧 Build system or dependency changes"
                echo "  ci:       👷 CI/CD configuration changes"
                echo "  chore:    🔨 Maintenance tasks"
                echo "  revert:   ⏪ Revert a previous commit"
                echo "  style:    💄 Code style changes (formatting, etc.)"
                echo ""
                echo "Breaking changes:"
                echo "  Use ! after type: feat!: breaking change description"
                echo ""
                echo "Examples:"
                echo "  ✓ feat: add deregistration delay configuration"
                echo "  ✓ fix: correct unhealthy threshold variable name"
                echo "  ✓ security: add S3 bucket encryption for access logs"
                echo "  ✓ docs: improve variable descriptions using HEREDOC"
                echo "  ✓ feat(alb): add listener rule priority documentation"
                echo "  ✓ feat!: remove deprecated variables (breaking change)"
                echo ""
                echo "Your message:"
                echo "  $commit_msg"
                echo ""
                echo "See: https://www.conventionalcommits.org/"
                exit 1
            fi
            
            # Success - message is valid
            exit 0
        EOT
      + file                         = "./hooks/commit-msg"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-instance-profile"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-iso27001"].github_repository_file.commit_msg_hook[0] will be created
  + resource "github_repository_file" "commit_msg_hook" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add commit-msg hook"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            #!/usr/bin/env bash
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            
            # Validates commit messages follow conventional commit format
            # See: https://www.conventionalcommits.org/
            
            set -e
            
            commit_msg_file=$1
            commit_msg=$(cat "$commit_msg_file")
            
            # Skip validation for merge commits
            if echo "$commit_msg" | grep -qE '^Merge (branch|pull request)'; then
                exit 0
            fi
            
            # Conventional commit pattern
            # Supports: type(scope): description or type: description
            # Types: feat, fix, docs, style, refactor, perf, test, build, ci, chore, revert, security
            # Optional ! for breaking changes: feat!: description
            pattern='^(feat|fix|docs|style|refactor|perf|test|build|ci|chore|revert|security)(\(.+\))?!?: .{1,}'
            
            if ! echo "$commit_msg" | grep -qE "$pattern"; then
                echo "❌ Invalid commit message format"
                echo ""
                echo "📝 Commit message must follow Conventional Commits:"
                echo ""
                echo "  <type>[optional scope][!]: <description>"
                echo ""
                echo "  [optional body]"
                echo ""
                echo "  [optional footer(s)]"
                echo ""
                echo "Types:"
                echo "  feat:     ✨ New feature"
                echo "  fix:      🐛 Bug fix"
                echo "  docs:     📚 Documentation changes"
                echo "  security: 🔒 Security improvements"
                echo "  refactor: ♻️  Code refactoring (no functional changes)"
                echo "  perf:     ⚡ Performance improvement"
                echo "  test:     ✅ Adding or updating tests"
                echo "  build:    🔧 Build system or dependency changes"
                echo "  ci:       👷 CI/CD configuration changes"
                echo "  chore:    🔨 Maintenance tasks"
                echo "  revert:   ⏪ Revert a previous commit"
                echo "  style:    💄 Code style changes (formatting, etc.)"
                echo ""
                echo "Breaking changes:"
                echo "  Use ! after type: feat!: breaking change description"
                echo ""
                echo "Examples:"
                echo "  ✓ feat: add deregistration delay configuration"
                echo "  ✓ fix: correct unhealthy threshold variable name"
                echo "  ✓ security: add S3 bucket encryption for access logs"
                echo "  ✓ docs: improve variable descriptions using HEREDOC"
                echo "  ✓ feat(alb): add listener rule priority documentation"
                echo "  ✓ feat!: remove deprecated variables (breaking change)"
                echo ""
                echo "Your message:"
                echo "  $commit_msg"
                echo ""
                echo "See: https://www.conventionalcommits.org/"
                exit 1
            fi
            
            # Success - message is valid
            exit 0
        EOT
      + file                         = "./hooks/commit-msg"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-iso27001"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-jumphost"].github_repository_file.commit_msg_hook[0] will be created
  + resource "github_repository_file" "commit_msg_hook" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add commit-msg hook"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            #!/usr/bin/env bash
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            
            # Validates commit messages follow conventional commit format
            # See: https://www.conventionalcommits.org/
            
            set -e
            
            commit_msg_file=$1
            commit_msg=$(cat "$commit_msg_file")
            
            # Skip validation for merge commits
            if echo "$commit_msg" | grep -qE '^Merge (branch|pull request)'; then
                exit 0
            fi
            
            # Conventional commit pattern
            # Supports: type(scope): description or type: description
            # Types: feat, fix, docs, style, refactor, perf, test, build, ci, chore, revert, security
            # Optional ! for breaking changes: feat!: description
            pattern='^(feat|fix|docs|style|refactor|perf|test|build|ci|chore|revert|security)(\(.+\))?!?: .{1,}'
            
            if ! echo "$commit_msg" | grep -qE "$pattern"; then
                echo "❌ Invalid commit message format"
                echo ""
                echo "📝 Commit message must follow Conventional Commits:"
                echo ""
                echo "  <type>[optional scope][!]: <description>"
                echo ""
                echo "  [optional body]"
                echo ""
                echo "  [optional footer(s)]"
                echo ""
                echo "Types:"
                echo "  feat:     ✨ New feature"
                echo "  fix:      🐛 Bug fix"
                echo "  docs:     📚 Documentation changes"
                echo "  security: 🔒 Security improvements"
                echo "  refactor: ♻️  Code refactoring (no functional changes)"
                echo "  perf:     ⚡ Performance improvement"
                echo "  test:     ✅ Adding or updating tests"
                echo "  build:    🔧 Build system or dependency changes"
                echo "  ci:       👷 CI/CD configuration changes"
                echo "  chore:    🔨 Maintenance tasks"
                echo "  revert:   ⏪ Revert a previous commit"
                echo "  style:    💄 Code style changes (formatting, etc.)"
                echo ""
                echo "Breaking changes:"
                echo "  Use ! after type: feat!: breaking change description"
                echo ""
                echo "Examples:"
                echo "  ✓ feat: add deregistration delay configuration"
                echo "  ✓ fix: correct unhealthy threshold variable name"
                echo "  ✓ security: add S3 bucket encryption for access logs"
                echo "  ✓ docs: improve variable descriptions using HEREDOC"
                echo "  ✓ feat(alb): add listener rule priority documentation"
                echo "  ✓ feat!: remove deprecated variables (breaking change)"
                echo ""
                echo "Your message:"
                echo "  $commit_msg"
                echo ""
                echo "See: https://www.conventionalcommits.org/"
                exit 1
            fi
            
            # Success - message is valid
            exit 0
        EOT
      + file                         = "./hooks/commit-msg"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-jumphost"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-key"].github_repository_file.commit_msg_hook[0] will be created
  + resource "github_repository_file" "commit_msg_hook" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add commit-msg hook"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            #!/usr/bin/env bash
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            
            # Validates commit messages follow conventional commit format
            # See: https://www.conventionalcommits.org/
            
            set -e
            
            commit_msg_file=$1
            commit_msg=$(cat "$commit_msg_file")
            
            # Skip validation for merge commits
            if echo "$commit_msg" | grep -qE '^Merge (branch|pull request)'; then
                exit 0
            fi
            
            # Conventional commit pattern
            # Supports: type(scope): description or type: description
            # Types: feat, fix, docs, style, refactor, perf, test, build, ci, chore, revert, security
            # Optional ! for breaking changes: feat!: description
            pattern='^(feat|fix|docs|style|refactor|perf|test|build|ci|chore|revert|security)(\(.+\))?!?: .{1,}'
            
            if ! echo "$commit_msg" | grep -qE "$pattern"; then
                echo "❌ Invalid commit message format"
                echo ""
                echo "📝 Commit message must follow Conventional Commits:"
                echo ""
                echo "  <type>[optional scope][!]: <description>"
                echo ""
                echo "  [optional body]"
                echo ""
                echo "  [optional footer(s)]"
                echo ""
                echo "Types:"
                echo "  feat:     ✨ New feature"
                echo "  fix:      🐛 Bug fix"
                echo "  docs:     📚 Documentation changes"
                echo "  security: 🔒 Security improvements"
                echo "  refactor: ♻️  Code refactoring (no functional changes)"
                echo "  perf:     ⚡ Performance improvement"
                echo "  test:     ✅ Adding or updating tests"
                echo "  build:    🔧 Build system or dependency changes"
                echo "  ci:       👷 CI/CD configuration changes"
                echo "  chore:    🔨 Maintenance tasks"
                echo "  revert:   ⏪ Revert a previous commit"
                echo "  style:    💄 Code style changes (formatting, etc.)"
                echo ""
                echo "Breaking changes:"
                echo "  Use ! after type: feat!: breaking change description"
                echo ""
                echo "Examples:"
                echo "  ✓ feat: add deregistration delay configuration"
                echo "  ✓ fix: correct unhealthy threshold variable name"
                echo "  ✓ security: add S3 bucket encryption for access logs"
                echo "  ✓ docs: improve variable descriptions using HEREDOC"
                echo "  ✓ feat(alb): add listener rule priority documentation"
                echo "  ✓ feat!: remove deprecated variables (breaking change)"
                echo ""
                echo "Your message:"
                echo "  $commit_msg"
                echo ""
                echo "See: https://www.conventionalcommits.org/"
                exit 1
            fi
            
            # Success - message is valid
            exit 0
        EOT
      + file                         = "./hooks/commit-msg"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-key"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-kibana"].github_repository_file.commit_msg_hook[0] will be created
  + resource "github_repository_file" "commit_msg_hook" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add commit-msg hook"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            #!/usr/bin/env bash
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            
            # Validates commit messages follow conventional commit format
            # See: https://www.conventionalcommits.org/
            
            set -e
            
            commit_msg_file=$1
            commit_msg=$(cat "$commit_msg_file")
            
            # Skip validation for merge commits
            if echo "$commit_msg" | grep -qE '^Merge (branch|pull request)'; then
                exit 0
            fi
            
            # Conventional commit pattern
            # Supports: type(scope): description or type: description
            # Types: feat, fix, docs, style, refactor, perf, test, build, ci, chore, revert, security
            # Optional ! for breaking changes: feat!: description
            pattern='^(feat|fix|docs|style|refactor|perf|test|build|ci|chore|revert|security)(\(.+\))?!?: .{1,}'
            
            if ! echo "$commit_msg" | grep -qE "$pattern"; then
                echo "❌ Invalid commit message format"
                echo ""
                echo "📝 Commit message must follow Conventional Commits:"
                echo ""
                echo "  <type>[optional scope][!]: <description>"
                echo ""
                echo "  [optional body]"
                echo ""
                echo "  [optional footer(s)]"
                echo ""
                echo "Types:"
                echo "  feat:     ✨ New feature"
                echo "  fix:      🐛 Bug fix"
                echo "  docs:     📚 Documentation changes"
                echo "  security: 🔒 Security improvements"
                echo "  refactor: ♻️  Code refactoring (no functional changes)"
                echo "  perf:     ⚡ Performance improvement"
                echo "  test:     ✅ Adding or updating tests"
                echo "  build:    🔧 Build system or dependency changes"
                echo "  ci:       👷 CI/CD configuration changes"
                echo "  chore:    🔨 Maintenance tasks"
                echo "  revert:   ⏪ Revert a previous commit"
                echo "  style:    💄 Code style changes (formatting, etc.)"
                echo ""
                echo "Breaking changes:"
                echo "  Use ! after type: feat!: breaking change description"
                echo ""
                echo "Examples:"
                echo "  ✓ feat: add deregistration delay configuration"
                echo "  ✓ fix: correct unhealthy threshold variable name"
                echo "  ✓ security: add S3 bucket encryption for access logs"
                echo "  ✓ docs: improve variable descriptions using HEREDOC"
                echo "  ✓ feat(alb): add listener rule priority documentation"
                echo "  ✓ feat!: remove deprecated variables (breaking change)"
                echo ""
                echo "Your message:"
                echo "  $commit_msg"
                echo ""
                echo "See: https://www.conventionalcommits.org/"
                exit 1
            fi
            
            # Success - message is valid
            exit 0
        EOT
      + file                         = "./hooks/commit-msg"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-kibana"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-lambda-monitored"].github_repository_file.commit_msg_hook[0] will be created
  + resource "github_repository_file" "commit_msg_hook" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add commit-msg hook"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            #!/usr/bin/env bash
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            
            # Validates commit messages follow conventional commit format
            # See: https://www.conventionalcommits.org/
            
            set -e
            
            commit_msg_file=$1
            commit_msg=$(cat "$commit_msg_file")
            
            # Skip validation for merge commits
            if echo "$commit_msg" | grep -qE '^Merge (branch|pull request)'; then
                exit 0
            fi
            
            # Conventional commit pattern
            # Supports: type(scope): description or type: description
            # Types: feat, fix, docs, style, refactor, perf, test, build, ci, chore, revert, security
            # Optional ! for breaking changes: feat!: description
            pattern='^(feat|fix|docs|style|refactor|perf|test|build|ci|chore|revert|security)(\(.+\))?!?: .{1,}'
            
            if ! echo "$commit_msg" | grep -qE "$pattern"; then
                echo "❌ Invalid commit message format"
                echo ""
                echo "📝 Commit message must follow Conventional Commits:"
                echo ""
                echo "  <type>[optional scope][!]: <description>"
                echo ""
                echo "  [optional body]"
                echo ""
                echo "  [optional footer(s)]"
                echo ""
                echo "Types:"
                echo "  feat:     ✨ New feature"
                echo "  fix:      🐛 Bug fix"
                echo "  docs:     📚 Documentation changes"
                echo "  security: 🔒 Security improvements"
                echo "  refactor: ♻️  Code refactoring (no functional changes)"
                echo "  perf:     ⚡ Performance improvement"
                echo "  test:     ✅ Adding or updating tests"
                echo "  build:    🔧 Build system or dependency changes"
                echo "  ci:       👷 CI/CD configuration changes"
                echo "  chore:    🔨 Maintenance tasks"
                echo "  revert:   ⏪ Revert a previous commit"
                echo "  style:    💄 Code style changes (formatting, etc.)"
                echo ""
                echo "Breaking changes:"
                echo "  Use ! after type: feat!: breaking change description"
                echo ""
                echo "Examples:"
                echo "  ✓ feat: add deregistration delay configuration"
                echo "  ✓ fix: correct unhealthy threshold variable name"
                echo "  ✓ security: add S3 bucket encryption for access logs"
                echo "  ✓ docs: improve variable descriptions using HEREDOC"
                echo "  ✓ feat(alb): add listener rule priority documentation"
                echo "  ✓ feat!: remove deprecated variables (breaking change)"
                echo ""
                echo "Your message:"
                echo "  $commit_msg"
                echo ""
                echo "See: https://www.conventionalcommits.org/"
                exit 1
            fi
            
            # Success - message is valid
            exit 0
        EOT
      + file                         = "./hooks/commit-msg"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-lambda-monitored"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-openvpn"].github_repository_file.commit_msg_hook[0] will be created
  + resource "github_repository_file" "commit_msg_hook" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add commit-msg hook"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            #!/usr/bin/env bash
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            
            # Validates commit messages follow conventional commit format
            # See: https://www.conventionalcommits.org/
            
            set -e
            
            commit_msg_file=$1
            commit_msg=$(cat "$commit_msg_file")
            
            # Skip validation for merge commits
            if echo "$commit_msg" | grep -qE '^Merge (branch|pull request)'; then
                exit 0
            fi
            
            # Conventional commit pattern
            # Supports: type(scope): description or type: description
            # Types: feat, fix, docs, style, refactor, perf, test, build, ci, chore, revert, security
            # Optional ! for breaking changes: feat!: description
            pattern='^(feat|fix|docs|style|refactor|perf|test|build|ci|chore|revert|security)(\(.+\))?!?: .{1,}'
            
            if ! echo "$commit_msg" | grep -qE "$pattern"; then
                echo "❌ Invalid commit message format"
                echo ""
                echo "📝 Commit message must follow Conventional Commits:"
                echo ""
                echo "  <type>[optional scope][!]: <description>"
                echo ""
                echo "  [optional body]"
                echo ""
                echo "  [optional footer(s)]"
                echo ""
                echo "Types:"
                echo "  feat:     ✨ New feature"
                echo "  fix:      🐛 Bug fix"
                echo "  docs:     📚 Documentation changes"
                echo "  security: 🔒 Security improvements"
                echo "  refactor: ♻️  Code refactoring (no functional changes)"
                echo "  perf:     ⚡ Performance improvement"
                echo "  test:     ✅ Adding or updating tests"
                echo "  build:    🔧 Build system or dependency changes"
                echo "  ci:       👷 CI/CD configuration changes"
                echo "  chore:    🔨 Maintenance tasks"
                echo "  revert:   ⏪ Revert a previous commit"
                echo "  style:    💄 Code style changes (formatting, etc.)"
                echo ""
                echo "Breaking changes:"
                echo "  Use ! after type: feat!: breaking change description"
                echo ""
                echo "Examples:"
                echo "  ✓ feat: add deregistration delay configuration"
                echo "  ✓ fix: correct unhealthy threshold variable name"
                echo "  ✓ security: add S3 bucket encryption for access logs"
                echo "  ✓ docs: improve variable descriptions using HEREDOC"
                echo "  ✓ feat(alb): add listener rule priority documentation"
                echo "  ✓ feat!: remove deprecated variables (breaking change)"
                echo ""
                echo "Your message:"
                echo "  $commit_msg"
                echo ""
                echo "See: https://www.conventionalcommits.org/"
                exit 1
            fi
            
            # Success - message is valid
            exit 0
        EOT
      + file                         = "./hooks/commit-msg"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-openvpn"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-pmm-ecs"].github_repository_file.commit_msg_hook[0] will be created
  + resource "github_repository_file" "commit_msg_hook" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add commit-msg hook"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            #!/usr/bin/env bash
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            
            # Validates commit messages follow conventional commit format
            # See: https://www.conventionalcommits.org/
            
            set -e
            
            commit_msg_file=$1
            commit_msg=$(cat "$commit_msg_file")
            
            # Skip validation for merge commits
            if echo "$commit_msg" | grep -qE '^Merge (branch|pull request)'; then
                exit 0
            fi
            
            # Conventional commit pattern
            # Supports: type(scope): description or type: description
            # Types: feat, fix, docs, style, refactor, perf, test, build, ci, chore, revert, security
            # Optional ! for breaking changes: feat!: description
            pattern='^(feat|fix|docs|style|refactor|perf|test|build|ci|chore|revert|security)(\(.+\))?!?: .{1,}'
            
            if ! echo "$commit_msg" | grep -qE "$pattern"; then
                echo "❌ Invalid commit message format"
                echo ""
                echo "📝 Commit message must follow Conventional Commits:"
                echo ""
                echo "  <type>[optional scope][!]: <description>"
                echo ""
                echo "  [optional body]"
                echo ""
                echo "  [optional footer(s)]"
                echo ""
                echo "Types:"
                echo "  feat:     ✨ New feature"
                echo "  fix:      🐛 Bug fix"
                echo "  docs:     📚 Documentation changes"
                echo "  security: 🔒 Security improvements"
                echo "  refactor: ♻️  Code refactoring (no functional changes)"
                echo "  perf:     ⚡ Performance improvement"
                echo "  test:     ✅ Adding or updating tests"
                echo "  build:    🔧 Build system or dependency changes"
                echo "  ci:       👷 CI/CD configuration changes"
                echo "  chore:    🔨 Maintenance tasks"
                echo "  revert:   ⏪ Revert a previous commit"
                echo "  style:    💄 Code style changes (formatting, etc.)"
                echo ""
                echo "Breaking changes:"
                echo "  Use ! after type: feat!: breaking change description"
                echo ""
                echo "Examples:"
                echo "  ✓ feat: add deregistration delay configuration"
                echo "  ✓ fix: correct unhealthy threshold variable name"
                echo "  ✓ security: add S3 bucket encryption for access logs"
                echo "  ✓ docs: improve variable descriptions using HEREDOC"
                echo "  ✓ feat(alb): add listener rule priority documentation"
                echo "  ✓ feat!: remove deprecated variables (breaking change)"
                echo ""
                echo "Your message:"
                echo "  $commit_msg"
                echo ""
                echo "See: https://www.conventionalcommits.org/"
                exit 1
            fi
            
            # Success - message is valid
            exit 0
        EOT
      + file                         = "./hooks/commit-msg"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-pmm-ecs"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-postfix"].github_repository_file.commit_msg_hook[0] will be created
  + resource "github_repository_file" "commit_msg_hook" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add commit-msg hook"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            #!/usr/bin/env bash
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            
            # Validates commit messages follow conventional commit format
            # See: https://www.conventionalcommits.org/
            
            set -e
            
            commit_msg_file=$1
            commit_msg=$(cat "$commit_msg_file")
            
            # Skip validation for merge commits
            if echo "$commit_msg" | grep -qE '^Merge (branch|pull request)'; then
                exit 0
            fi
            
            # Conventional commit pattern
            # Supports: type(scope): description or type: description
            # Types: feat, fix, docs, style, refactor, perf, test, build, ci, chore, revert, security
            # Optional ! for breaking changes: feat!: description
            pattern='^(feat|fix|docs|style|refactor|perf|test|build|ci|chore|revert|security)(\(.+\))?!?: .{1,}'
            
            if ! echo "$commit_msg" | grep -qE "$pattern"; then
                echo "❌ Invalid commit message format"
                echo ""
                echo "📝 Commit message must follow Conventional Commits:"
                echo ""
                echo "  <type>[optional scope][!]: <description>"
                echo ""
                echo "  [optional body]"
                echo ""
                echo "  [optional footer(s)]"
                echo ""
                echo "Types:"
                echo "  feat:     ✨ New feature"
                echo "  fix:      🐛 Bug fix"
                echo "  docs:     📚 Documentation changes"
                echo "  security: 🔒 Security improvements"
                echo "  refactor: ♻️  Code refactoring (no functional changes)"
                echo "  perf:     ⚡ Performance improvement"
                echo "  test:     ✅ Adding or updating tests"
                echo "  build:    🔧 Build system or dependency changes"
                echo "  ci:       👷 CI/CD configuration changes"
                echo "  chore:    🔨 Maintenance tasks"
                echo "  revert:   ⏪ Revert a previous commit"
                echo "  style:    💄 Code style changes (formatting, etc.)"
                echo ""
                echo "Breaking changes:"
                echo "  Use ! after type: feat!: breaking change description"
                echo ""
                echo "Examples:"
                echo "  ✓ feat: add deregistration delay configuration"
                echo "  ✓ fix: correct unhealthy threshold variable name"
                echo "  ✓ security: add S3 bucket encryption for access logs"
                echo "  ✓ docs: improve variable descriptions using HEREDOC"
                echo "  ✓ feat(alb): add listener rule priority documentation"
                echo "  ✓ feat!: remove deprecated variables (breaking change)"
                echo ""
                echo "Your message:"
                echo "  $commit_msg"
                echo ""
                echo "See: https://www.conventionalcommits.org/"
                exit 1
            fi
            
            # Success - message is valid
            exit 0
        EOT
      + file                         = "./hooks/commit-msg"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-postfix"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-pypiserver"].github_repository_file.commit_msg_hook[0] will be created
  + resource "github_repository_file" "commit_msg_hook" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add commit-msg hook"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            #!/usr/bin/env bash
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            
            # Validates commit messages follow conventional commit format
            # See: https://www.conventionalcommits.org/
            
            set -e
            
            commit_msg_file=$1
            commit_msg=$(cat "$commit_msg_file")
            
            # Skip validation for merge commits
            if echo "$commit_msg" | grep -qE '^Merge (branch|pull request)'; then
                exit 0
            fi
            
            # Conventional commit pattern
            # Supports: type(scope): description or type: description
            # Types: feat, fix, docs, style, refactor, perf, test, build, ci, chore, revert, security
            # Optional ! for breaking changes: feat!: description
            pattern='^(feat|fix|docs|style|refactor|perf|test|build|ci|chore|revert|security)(\(.+\))?!?: .{1,}'
            
            if ! echo "$commit_msg" | grep -qE "$pattern"; then
                echo "❌ Invalid commit message format"
                echo ""
                echo "📝 Commit message must follow Conventional Commits:"
                echo ""
                echo "  <type>[optional scope][!]: <description>"
                echo ""
                echo "  [optional body]"
                echo ""
                echo "  [optional footer(s)]"
                echo ""
                echo "Types:"
                echo "  feat:     ✨ New feature"
                echo "  fix:      🐛 Bug fix"
                echo "  docs:     📚 Documentation changes"
                echo "  security: 🔒 Security improvements"
                echo "  refactor: ♻️  Code refactoring (no functional changes)"
                echo "  perf:     ⚡ Performance improvement"
                echo "  test:     ✅ Adding or updating tests"
                echo "  build:    🔧 Build system or dependency changes"
                echo "  ci:       👷 CI/CD configuration changes"
                echo "  chore:    🔨 Maintenance tasks"
                echo "  revert:   ⏪ Revert a previous commit"
                echo "  style:    💄 Code style changes (formatting, etc.)"
                echo ""
                echo "Breaking changes:"
                echo "  Use ! after type: feat!: breaking change description"
                echo ""
                echo "Examples:"
                echo "  ✓ feat: add deregistration delay configuration"
                echo "  ✓ fix: correct unhealthy threshold variable name"
                echo "  ✓ security: add S3 bucket encryption for access logs"
                echo "  ✓ docs: improve variable descriptions using HEREDOC"
                echo "  ✓ feat(alb): add listener rule priority documentation"
                echo "  ✓ feat!: remove deprecated variables (breaking change)"
                echo ""
                echo "Your message:"
                echo "  $commit_msg"
                echo ""
                echo "See: https://www.conventionalcommits.org/"
                exit 1
            fi
            
            # Success - message is valid
            exit 0
        EOT
      + file                         = "./hooks/commit-msg"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-pypiserver"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-registry"].github_repository_file.commit_msg_hook[0] will be created
  + resource "github_repository_file" "commit_msg_hook" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add commit-msg hook"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            #!/usr/bin/env bash
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            
            # Validates commit messages follow conventional commit format
            # See: https://www.conventionalcommits.org/
            
            set -e
            
            commit_msg_file=$1
            commit_msg=$(cat "$commit_msg_file")
            
            # Skip validation for merge commits
            if echo "$commit_msg" | grep -qE '^Merge (branch|pull request)'; then
                exit 0
            fi
            
            # Conventional commit pattern
            # Supports: type(scope): description or type: description
            # Types: feat, fix, docs, style, refactor, perf, test, build, ci, chore, revert, security
            # Optional ! for breaking changes: feat!: description
            pattern='^(feat|fix|docs|style|refactor|perf|test|build|ci|chore|revert|security)(\(.+\))?!?: .{1,}'
            
            if ! echo "$commit_msg" | grep -qE "$pattern"; then
                echo "❌ Invalid commit message format"
                echo ""
                echo "📝 Commit message must follow Conventional Commits:"
                echo ""
                echo "  <type>[optional scope][!]: <description>"
                echo ""
                echo "  [optional body]"
                echo ""
                echo "  [optional footer(s)]"
                echo ""
                echo "Types:"
                echo "  feat:     ✨ New feature"
                echo "  fix:      🐛 Bug fix"
                echo "  docs:     📚 Documentation changes"
                echo "  security: 🔒 Security improvements"
                echo "  refactor: ♻️  Code refactoring (no functional changes)"
                echo "  perf:     ⚡ Performance improvement"
                echo "  test:     ✅ Adding or updating tests"
                echo "  build:    🔧 Build system or dependency changes"
                echo "  ci:       👷 CI/CD configuration changes"
                echo "  chore:    🔨 Maintenance tasks"
                echo "  revert:   ⏪ Revert a previous commit"
                echo "  style:    💄 Code style changes (formatting, etc.)"
                echo ""
                echo "Breaking changes:"
                echo "  Use ! after type: feat!: breaking change description"
                echo ""
                echo "Examples:"
                echo "  ✓ feat: add deregistration delay configuration"
                echo "  ✓ fix: correct unhealthy threshold variable name"
                echo "  ✓ security: add S3 bucket encryption for access logs"
                echo "  ✓ docs: improve variable descriptions using HEREDOC"
                echo "  ✓ feat(alb): add listener rule priority documentation"
                echo "  ✓ feat!: remove deprecated variables (breaking change)"
                echo ""
                echo "Your message:"
                echo "  $commit_msg"
                echo ""
                echo "See: https://www.conventionalcommits.org/"
                exit 1
            fi
            
            # Success - message is valid
            exit 0
        EOT
      + file                         = "./hooks/commit-msg"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-registry"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-s3-bucket"].github_repository_file.commit_msg_hook[0] will be created
  + resource "github_repository_file" "commit_msg_hook" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add commit-msg hook"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            #!/usr/bin/env bash
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            
            # Validates commit messages follow conventional commit format
            # See: https://www.conventionalcommits.org/
            
            set -e
            
            commit_msg_file=$1
            commit_msg=$(cat "$commit_msg_file")
            
            # Skip validation for merge commits
            if echo "$commit_msg" | grep -qE '^Merge (branch|pull request)'; then
                exit 0
            fi
            
            # Conventional commit pattern
            # Supports: type(scope): description or type: description
            # Types: feat, fix, docs, style, refactor, perf, test, build, ci, chore, revert, security
            # Optional ! for breaking changes: feat!: description
            pattern='^(feat|fix|docs|style|refactor|perf|test|build|ci|chore|revert|security)(\(.+\))?!?: .{1,}'
            
            if ! echo "$commit_msg" | grep -qE "$pattern"; then
                echo "❌ Invalid commit message format"
                echo ""
                echo "📝 Commit message must follow Conventional Commits:"
                echo ""
                echo "  <type>[optional scope][!]: <description>"
                echo ""
                echo "  [optional body]"
                echo ""
                echo "  [optional footer(s)]"
                echo ""
                echo "Types:"
                echo "  feat:     ✨ New feature"
                echo "  fix:      🐛 Bug fix"
                echo "  docs:     📚 Documentation changes"
                echo "  security: 🔒 Security improvements"
                echo "  refactor: ♻️  Code refactoring (no functional changes)"
                echo "  perf:     ⚡ Performance improvement"
                echo "  test:     ✅ Adding or updating tests"
                echo "  build:    🔧 Build system or dependency changes"
                echo "  ci:       👷 CI/CD configuration changes"
                echo "  chore:    🔨 Maintenance tasks"
                echo "  revert:   ⏪ Revert a previous commit"
                echo "  style:    💄 Code style changes (formatting, etc.)"
                echo ""
                echo "Breaking changes:"
                echo "  Use ! after type: feat!: breaking change description"
                echo ""
                echo "Examples:"
                echo "  ✓ feat: add deregistration delay configuration"
                echo "  ✓ fix: correct unhealthy threshold variable name"
                echo "  ✓ security: add S3 bucket encryption for access logs"
                echo "  ✓ docs: improve variable descriptions using HEREDOC"
                echo "  ✓ feat(alb): add listener rule priority documentation"
                echo "  ✓ feat!: remove deprecated variables (breaking change)"
                echo ""
                echo "Your message:"
                echo "  $commit_msg"
                echo ""
                echo "See: https://www.conventionalcommits.org/"
                exit 1
            fi
            
            # Success - message is valid
            exit 0
        EOT
      + file                         = "./hooks/commit-msg"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-s3-bucket"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-secret"].github_repository_file.commit_msg_hook[0] will be created
  + resource "github_repository_file" "commit_msg_hook" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add commit-msg hook"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            #!/usr/bin/env bash
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            
            # Validates commit messages follow conventional commit format
            # See: https://www.conventionalcommits.org/
            
            set -e
            
            commit_msg_file=$1
            commit_msg=$(cat "$commit_msg_file")
            
            # Skip validation for merge commits
            if echo "$commit_msg" | grep -qE '^Merge (branch|pull request)'; then
                exit 0
            fi
            
            # Conventional commit pattern
            # Supports: type(scope): description or type: description
            # Types: feat, fix, docs, style, refactor, perf, test, build, ci, chore, revert, security
            # Optional ! for breaking changes: feat!: description
            pattern='^(feat|fix|docs|style|refactor|perf|test|build|ci|chore|revert|security)(\(.+\))?!?: .{1,}'
            
            if ! echo "$commit_msg" | grep -qE "$pattern"; then
                echo "❌ Invalid commit message format"
                echo ""
                echo "📝 Commit message must follow Conventional Commits:"
                echo ""
                echo "  <type>[optional scope][!]: <description>"
                echo ""
                echo "  [optional body]"
                echo ""
                echo "  [optional footer(s)]"
                echo ""
                echo "Types:"
                echo "  feat:     ✨ New feature"
                echo "  fix:      🐛 Bug fix"
                echo "  docs:     📚 Documentation changes"
                echo "  security: 🔒 Security improvements"
                echo "  refactor: ♻️  Code refactoring (no functional changes)"
                echo "  perf:     ⚡ Performance improvement"
                echo "  test:     ✅ Adding or updating tests"
                echo "  build:    🔧 Build system or dependency changes"
                echo "  ci:       👷 CI/CD configuration changes"
                echo "  chore:    🔨 Maintenance tasks"
                echo "  revert:   ⏪ Revert a previous commit"
                echo "  style:    💄 Code style changes (formatting, etc.)"
                echo ""
                echo "Breaking changes:"
                echo "  Use ! after type: feat!: breaking change description"
                echo ""
                echo "Examples:"
                echo "  ✓ feat: add deregistration delay configuration"
                echo "  ✓ fix: correct unhealthy threshold variable name"
                echo "  ✓ security: add S3 bucket encryption for access logs"
                echo "  ✓ docs: improve variable descriptions using HEREDOC"
                echo "  ✓ feat(alb): add listener rule priority documentation"
                echo "  ✓ feat!: remove deprecated variables (breaking change)"
                echo ""
                echo "Your message:"
                echo "  $commit_msg"
                echo ""
                echo "See: https://www.conventionalcommits.org/"
                exit 1
            fi
            
            # Success - message is valid
            exit 0
        EOT
      + file                         = "./hooks/commit-msg"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-secret"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-secret-policy"].github_repository_file.commit_msg_hook[0] will be created
  + resource "github_repository_file" "commit_msg_hook" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add commit-msg hook"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            #!/usr/bin/env bash
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            
            # Validates commit messages follow conventional commit format
            # See: https://www.conventionalcommits.org/
            
            set -e
            
            commit_msg_file=$1
            commit_msg=$(cat "$commit_msg_file")
            
            # Skip validation for merge commits
            if echo "$commit_msg" | grep -qE '^Merge (branch|pull request)'; then
                exit 0
            fi
            
            # Conventional commit pattern
            # Supports: type(scope): description or type: description
            # Types: feat, fix, docs, style, refactor, perf, test, build, ci, chore, revert, security
            # Optional ! for breaking changes: feat!: description
            pattern='^(feat|fix|docs|style|refactor|perf|test|build|ci|chore|revert|security)(\(.+\))?!?: .{1,}'
            
            if ! echo "$commit_msg" | grep -qE "$pattern"; then
                echo "❌ Invalid commit message format"
                echo ""
                echo "📝 Commit message must follow Conventional Commits:"
                echo ""
                echo "  <type>[optional scope][!]: <description>"
                echo ""
                echo "  [optional body]"
                echo ""
                echo "  [optional footer(s)]"
                echo ""
                echo "Types:"
                echo "  feat:     ✨ New feature"
                echo "  fix:      🐛 Bug fix"
                echo "  docs:     📚 Documentation changes"
                echo "  security: 🔒 Security improvements"
                echo "  refactor: ♻️  Code refactoring (no functional changes)"
                echo "  perf:     ⚡ Performance improvement"
                echo "  test:     ✅ Adding or updating tests"
                echo "  build:    🔧 Build system or dependency changes"
                echo "  ci:       👷 CI/CD configuration changes"
                echo "  chore:    🔨 Maintenance tasks"
                echo "  revert:   ⏪ Revert a previous commit"
                echo "  style:    💄 Code style changes (formatting, etc.)"
                echo ""
                echo "Breaking changes:"
                echo "  Use ! after type: feat!: breaking change description"
                echo ""
                echo "Examples:"
                echo "  ✓ feat: add deregistration delay configuration"
                echo "  ✓ fix: correct unhealthy threshold variable name"
                echo "  ✓ security: add S3 bucket encryption for access logs"
                echo "  ✓ docs: improve variable descriptions using HEREDOC"
                echo "  ✓ feat(alb): add listener rule priority documentation"
                echo "  ✓ feat!: remove deprecated variables (breaking change)"
                echo ""
                echo "Your message:"
                echo "  $commit_msg"
                echo ""
                echo "See: https://www.conventionalcommits.org/"
                exit 1
            fi
            
            # Success - message is valid
            exit 0
        EOT
      + file                         = "./hooks/commit-msg"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-secret-policy"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-service-network"].github_repository_file.commit_msg_hook[0] will be created
  + resource "github_repository_file" "commit_msg_hook" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add commit-msg hook"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            #!/usr/bin/env bash
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            
            # Validates commit messages follow conventional commit format
            # See: https://www.conventionalcommits.org/
            
            set -e
            
            commit_msg_file=$1
            commit_msg=$(cat "$commit_msg_file")
            
            # Skip validation for merge commits
            if echo "$commit_msg" | grep -qE '^Merge (branch|pull request)'; then
                exit 0
            fi
            
            # Conventional commit pattern
            # Supports: type(scope): description or type: description
            # Types: feat, fix, docs, style, refactor, perf, test, build, ci, chore, revert, security
            # Optional ! for breaking changes: feat!: description
            pattern='^(feat|fix|docs|style|refactor|perf|test|build|ci|chore|revert|security)(\(.+\))?!?: .{1,}'
            
            if ! echo "$commit_msg" | grep -qE "$pattern"; then
                echo "❌ Invalid commit message format"
                echo ""
                echo "📝 Commit message must follow Conventional Commits:"
                echo ""
                echo "  <type>[optional scope][!]: <description>"
                echo ""
                echo "  [optional body]"
                echo ""
                echo "  [optional footer(s)]"
                echo ""
                echo "Types:"
                echo "  feat:     ✨ New feature"
                echo "  fix:      🐛 Bug fix"
                echo "  docs:     📚 Documentation changes"
                echo "  security: 🔒 Security improvements"
                echo "  refactor: ♻️  Code refactoring (no functional changes)"
                echo "  perf:     ⚡ Performance improvement"
                echo "  test:     ✅ Adding or updating tests"
                echo "  build:    🔧 Build system or dependency changes"
                echo "  ci:       👷 CI/CD configuration changes"
                echo "  chore:    🔨 Maintenance tasks"
                echo "  revert:   ⏪ Revert a previous commit"
                echo "  style:    💄 Code style changes (formatting, etc.)"
                echo ""
                echo "Breaking changes:"
                echo "  Use ! after type: feat!: breaking change description"
                echo ""
                echo "Examples:"
                echo "  ✓ feat: add deregistration delay configuration"
                echo "  ✓ fix: correct unhealthy threshold variable name"
                echo "  ✓ security: add S3 bucket encryption for access logs"
                echo "  ✓ docs: improve variable descriptions using HEREDOC"
                echo "  ✓ feat(alb): add listener rule priority documentation"
                echo "  ✓ feat!: remove deprecated variables (breaking change)"
                echo ""
                echo "Your message:"
                echo "  $commit_msg"
                echo ""
                echo "See: https://www.conventionalcommits.org/"
                exit 1
            fi
            
            # Success - message is valid
            exit 0
        EOT
      + file                         = "./hooks/commit-msg"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-service-network"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-sqs-ecs"].github_repository_file.commit_msg_hook[0] will be created
  + resource "github_repository_file" "commit_msg_hook" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add commit-msg hook"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            #!/usr/bin/env bash
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            
            # Validates commit messages follow conventional commit format
            # See: https://www.conventionalcommits.org/
            
            set -e
            
            commit_msg_file=$1
            commit_msg=$(cat "$commit_msg_file")
            
            # Skip validation for merge commits
            if echo "$commit_msg" | grep -qE '^Merge (branch|pull request)'; then
                exit 0
            fi
            
            # Conventional commit pattern
            # Supports: type(scope): description or type: description
            # Types: feat, fix, docs, style, refactor, perf, test, build, ci, chore, revert, security
            # Optional ! for breaking changes: feat!: description
            pattern='^(feat|fix|docs|style|refactor|perf|test|build|ci|chore|revert|security)(\(.+\))?!?: .{1,}'
            
            if ! echo "$commit_msg" | grep -qE "$pattern"; then
                echo "❌ Invalid commit message format"
                echo ""
                echo "📝 Commit message must follow Conventional Commits:"
                echo ""
                echo "  <type>[optional scope][!]: <description>"
                echo ""
                echo "  [optional body]"
                echo ""
                echo "  [optional footer(s)]"
                echo ""
                echo "Types:"
                echo "  feat:     ✨ New feature"
                echo "  fix:      🐛 Bug fix"
                echo "  docs:     📚 Documentation changes"
                echo "  security: 🔒 Security improvements"
                echo "  refactor: ♻️  Code refactoring (no functional changes)"
                echo "  perf:     ⚡ Performance improvement"
                echo "  test:     ✅ Adding or updating tests"
                echo "  build:    🔧 Build system or dependency changes"
                echo "  ci:       👷 CI/CD configuration changes"
                echo "  chore:    🔨 Maintenance tasks"
                echo "  revert:   ⏪ Revert a previous commit"
                echo "  style:    💄 Code style changes (formatting, etc.)"
                echo ""
                echo "Breaking changes:"
                echo "  Use ! after type: feat!: breaking change description"
                echo ""
                echo "Examples:"
                echo "  ✓ feat: add deregistration delay configuration"
                echo "  ✓ fix: correct unhealthy threshold variable name"
                echo "  ✓ security: add S3 bucket encryption for access logs"
                echo "  ✓ docs: improve variable descriptions using HEREDOC"
                echo "  ✓ feat(alb): add listener rule priority documentation"
                echo "  ✓ feat!: remove deprecated variables (breaking change)"
                echo ""
                echo "Your message:"
                echo "  $commit_msg"
                echo ""
                echo "See: https://www.conventionalcommits.org/"
                exit 1
            fi
            
            # Success - message is valid
            exit 0
        EOT
      + file                         = "./hooks/commit-msg"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-sqs-ecs"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-sqs-pod"].github_repository_file.commit_msg_hook[0] will be created
  + resource "github_repository_file" "commit_msg_hook" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add commit-msg hook"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            #!/usr/bin/env bash
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            
            # Validates commit messages follow conventional commit format
            # See: https://www.conventionalcommits.org/
            
            set -e
            
            commit_msg_file=$1
            commit_msg=$(cat "$commit_msg_file")
            
            # Skip validation for merge commits
            if echo "$commit_msg" | grep -qE '^Merge (branch|pull request)'; then
                exit 0
            fi
            
            # Conventional commit pattern
            # Supports: type(scope): description or type: description
            # Types: feat, fix, docs, style, refactor, perf, test, build, ci, chore, revert, security
            # Optional ! for breaking changes: feat!: description
            pattern='^(feat|fix|docs|style|refactor|perf|test|build|ci|chore|revert|security)(\(.+\))?!?: .{1,}'
            
            if ! echo "$commit_msg" | grep -qE "$pattern"; then
                echo "❌ Invalid commit message format"
                echo ""
                echo "📝 Commit message must follow Conventional Commits:"
                echo ""
                echo "  <type>[optional scope][!]: <description>"
                echo ""
                echo "  [optional body]"
                echo ""
                echo "  [optional footer(s)]"
                echo ""
                echo "Types:"
                echo "  feat:     ✨ New feature"
                echo "  fix:      🐛 Bug fix"
                echo "  docs:     📚 Documentation changes"
                echo "  security: 🔒 Security improvements"
                echo "  refactor: ♻️  Code refactoring (no functional changes)"
                echo "  perf:     ⚡ Performance improvement"
                echo "  test:     ✅ Adding or updating tests"
                echo "  build:    🔧 Build system or dependency changes"
                echo "  ci:       👷 CI/CD configuration changes"
                echo "  chore:    🔨 Maintenance tasks"
                echo "  revert:   ⏪ Revert a previous commit"
                echo "  style:    💄 Code style changes (formatting, etc.)"
                echo ""
                echo "Breaking changes:"
                echo "  Use ! after type: feat!: breaking change description"
                echo ""
                echo "Examples:"
                echo "  ✓ feat: add deregistration delay configuration"
                echo "  ✓ fix: correct unhealthy threshold variable name"
                echo "  ✓ security: add S3 bucket encryption for access logs"
                echo "  ✓ docs: improve variable descriptions using HEREDOC"
                echo "  ✓ feat(alb): add listener rule priority documentation"
                echo "  ✓ feat!: remove deprecated variables (breaking change)"
                echo ""
                echo "Your message:"
                echo "  $commit_msg"
                echo ""
                echo "See: https://www.conventionalcommits.org/"
                exit 1
            fi
            
            # Success - message is valid
            exit 0
        EOT
      + file                         = "./hooks/commit-msg"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-sqs-pod"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-state-bucket"].github_repository_file.commit_msg_hook[0] will be created
  + resource "github_repository_file" "commit_msg_hook" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add commit-msg hook"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            #!/usr/bin/env bash
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            
            # Validates commit messages follow conventional commit format
            # See: https://www.conventionalcommits.org/
            
            set -e
            
            commit_msg_file=$1
            commit_msg=$(cat "$commit_msg_file")
            
            # Skip validation for merge commits
            if echo "$commit_msg" | grep -qE '^Merge (branch|pull request)'; then
                exit 0
            fi
            
            # Conventional commit pattern
            # Supports: type(scope): description or type: description
            # Types: feat, fix, docs, style, refactor, perf, test, build, ci, chore, revert, security
            # Optional ! for breaking changes: feat!: description
            pattern='^(feat|fix|docs|style|refactor|perf|test|build|ci|chore|revert|security)(\(.+\))?!?: .{1,}'
            
            if ! echo "$commit_msg" | grep -qE "$pattern"; then
                echo "❌ Invalid commit message format"
                echo ""
                echo "📝 Commit message must follow Conventional Commits:"
                echo ""
                echo "  <type>[optional scope][!]: <description>"
                echo ""
                echo "  [optional body]"
                echo ""
                echo "  [optional footer(s)]"
                echo ""
                echo "Types:"
                echo "  feat:     ✨ New feature"
                echo "  fix:      🐛 Bug fix"
                echo "  docs:     📚 Documentation changes"
                echo "  security: 🔒 Security improvements"
                echo "  refactor: ♻️  Code refactoring (no functional changes)"
                echo "  perf:     ⚡ Performance improvement"
                echo "  test:     ✅ Adding or updating tests"
                echo "  build:    🔧 Build system or dependency changes"
                echo "  ci:       👷 CI/CD configuration changes"
                echo "  chore:    🔨 Maintenance tasks"
                echo "  revert:   ⏪ Revert a previous commit"
                echo "  style:    💄 Code style changes (formatting, etc.)"
                echo ""
                echo "Breaking changes:"
                echo "  Use ! after type: feat!: breaking change description"
                echo ""
                echo "Examples:"
                echo "  ✓ feat: add deregistration delay configuration"
                echo "  ✓ fix: correct unhealthy threshold variable name"
                echo "  ✓ security: add S3 bucket encryption for access logs"
                echo "  ✓ docs: improve variable descriptions using HEREDOC"
                echo "  ✓ feat(alb): add listener rule priority documentation"
                echo "  ✓ feat!: remove deprecated variables (breaking change)"
                echo ""
                echo "Your message:"
                echo "  $commit_msg"
                echo ""
                echo "See: https://www.conventionalcommits.org/"
                exit 1
            fi
            
            # Success - message is valid
            exit 0
        EOT
      + file                         = "./hooks/commit-msg"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-state-bucket"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-state-manager"].github_repository_file.commit_msg_hook[0] will be created
  + resource "github_repository_file" "commit_msg_hook" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add commit-msg hook"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            #!/usr/bin/env bash
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            
            # Validates commit messages follow conventional commit format
            # See: https://www.conventionalcommits.org/
            
            set -e
            
            commit_msg_file=$1
            commit_msg=$(cat "$commit_msg_file")
            
            # Skip validation for merge commits
            if echo "$commit_msg" | grep -qE '^Merge (branch|pull request)'; then
                exit 0
            fi
            
            # Conventional commit pattern
            # Supports: type(scope): description or type: description
            # Types: feat, fix, docs, style, refactor, perf, test, build, ci, chore, revert, security
            # Optional ! for breaking changes: feat!: description
            pattern='^(feat|fix|docs|style|refactor|perf|test|build|ci|chore|revert|security)(\(.+\))?!?: .{1,}'
            
            if ! echo "$commit_msg" | grep -qE "$pattern"; then
                echo "❌ Invalid commit message format"
                echo ""
                echo "📝 Commit message must follow Conventional Commits:"
                echo ""
                echo "  <type>[optional scope][!]: <description>"
                echo ""
                echo "  [optional body]"
                echo ""
                echo "  [optional footer(s)]"
                echo ""
                echo "Types:"
                echo "  feat:     ✨ New feature"
                echo "  fix:      🐛 Bug fix"
                echo "  docs:     📚 Documentation changes"
                echo "  security: 🔒 Security improvements"
                echo "  refactor: ♻️  Code refactoring (no functional changes)"
                echo "  perf:     ⚡ Performance improvement"
                echo "  test:     ✅ Adding or updating tests"
                echo "  build:    🔧 Build system or dependency changes"
                echo "  ci:       👷 CI/CD configuration changes"
                echo "  chore:    🔨 Maintenance tasks"
                echo "  revert:   ⏪ Revert a previous commit"
                echo "  style:    💄 Code style changes (formatting, etc.)"
                echo ""
                echo "Breaking changes:"
                echo "  Use ! after type: feat!: breaking change description"
                echo ""
                echo "Examples:"
                echo "  ✓ feat: add deregistration delay configuration"
                echo "  ✓ fix: correct unhealthy threshold variable name"
                echo "  ✓ security: add S3 bucket encryption for access logs"
                echo "  ✓ docs: improve variable descriptions using HEREDOC"
                echo "  ✓ feat(alb): add listener rule priority documentation"
                echo "  ✓ feat!: remove deprecated variables (breaking change)"
                echo ""
                echo "Your message:"
                echo "  $commit_msg"
                echo ""
                echo "See: https://www.conventionalcommits.org/"
                exit 1
            fi
            
            # Success - message is valid
            exit 0
        EOT
      + file                         = "./hooks/commit-msg"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-state-manager"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-tags-override"].github_repository_file.commit_msg_hook[0] will be created
  + resource "github_repository_file" "commit_msg_hook" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add commit-msg hook"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            #!/usr/bin/env bash
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            
            # Validates commit messages follow conventional commit format
            # See: https://www.conventionalcommits.org/
            
            set -e
            
            commit_msg_file=$1
            commit_msg=$(cat "$commit_msg_file")
            
            # Skip validation for merge commits
            if echo "$commit_msg" | grep -qE '^Merge (branch|pull request)'; then
                exit 0
            fi
            
            # Conventional commit pattern
            # Supports: type(scope): description or type: description
            # Types: feat, fix, docs, style, refactor, perf, test, build, ci, chore, revert, security
            # Optional ! for breaking changes: feat!: description
            pattern='^(feat|fix|docs|style|refactor|perf|test|build|ci|chore|revert|security)(\(.+\))?!?: .{1,}'
            
            if ! echo "$commit_msg" | grep -qE "$pattern"; then
                echo "❌ Invalid commit message format"
                echo ""
                echo "📝 Commit message must follow Conventional Commits:"
                echo ""
                echo "  <type>[optional scope][!]: <description>"
                echo ""
                echo "  [optional body]"
                echo ""
                echo "  [optional footer(s)]"
                echo ""
                echo "Types:"
                echo "  feat:     ✨ New feature"
                echo "  fix:      🐛 Bug fix"
                echo "  docs:     📚 Documentation changes"
                echo "  security: 🔒 Security improvements"
                echo "  refactor: ♻️  Code refactoring (no functional changes)"
                echo "  perf:     ⚡ Performance improvement"
                echo "  test:     ✅ Adding or updating tests"
                echo "  build:    🔧 Build system or dependency changes"
                echo "  ci:       👷 CI/CD configuration changes"
                echo "  chore:    🔨 Maintenance tasks"
                echo "  revert:   ⏪ Revert a previous commit"
                echo "  style:    💄 Code style changes (formatting, etc.)"
                echo ""
                echo "Breaking changes:"
                echo "  Use ! after type: feat!: breaking change description"
                echo ""
                echo "Examples:"
                echo "  ✓ feat: add deregistration delay configuration"
                echo "  ✓ fix: correct unhealthy threshold variable name"
                echo "  ✓ security: add S3 bucket encryption for access logs"
                echo "  ✓ docs: improve variable descriptions using HEREDOC"
                echo "  ✓ feat(alb): add listener rule priority documentation"
                echo "  ✓ feat!: remove deprecated variables (breaking change)"
                echo ""
                echo "Your message:"
                echo "  $commit_msg"
                echo ""
                echo "See: https://www.conventionalcommits.org/"
                exit 1
            fi
            
            # Success - message is valid
            exit 0
        EOT
      + file                         = "./hooks/commit-msg"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-tags-override"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-tcp-pod"].github_repository_file.commit_msg_hook[0] will be created
  + resource "github_repository_file" "commit_msg_hook" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add commit-msg hook"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            #!/usr/bin/env bash
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            
            # Validates commit messages follow conventional commit format
            # See: https://www.conventionalcommits.org/
            
            set -e
            
            commit_msg_file=$1
            commit_msg=$(cat "$commit_msg_file")
            
            # Skip validation for merge commits
            if echo "$commit_msg" | grep -qE '^Merge (branch|pull request)'; then
                exit 0
            fi
            
            # Conventional commit pattern
            # Supports: type(scope): description or type: description
            # Types: feat, fix, docs, style, refactor, perf, test, build, ci, chore, revert, security
            # Optional ! for breaking changes: feat!: description
            pattern='^(feat|fix|docs|style|refactor|perf|test|build|ci|chore|revert|security)(\(.+\))?!?: .{1,}'
            
            if ! echo "$commit_msg" | grep -qE "$pattern"; then
                echo "❌ Invalid commit message format"
                echo ""
                echo "📝 Commit message must follow Conventional Commits:"
                echo ""
                echo "  <type>[optional scope][!]: <description>"
                echo ""
                echo "  [optional body]"
                echo ""
                echo "  [optional footer(s)]"
                echo ""
                echo "Types:"
                echo "  feat:     ✨ New feature"
                echo "  fix:      🐛 Bug fix"
                echo "  docs:     📚 Documentation changes"
                echo "  security: 🔒 Security improvements"
                echo "  refactor: ♻️  Code refactoring (no functional changes)"
                echo "  perf:     ⚡ Performance improvement"
                echo "  test:     ✅ Adding or updating tests"
                echo "  build:    🔧 Build system or dependency changes"
                echo "  ci:       👷 CI/CD configuration changes"
                echo "  chore:    🔨 Maintenance tasks"
                echo "  revert:   ⏪ Revert a previous commit"
                echo "  style:    💄 Code style changes (formatting, etc.)"
                echo ""
                echo "Breaking changes:"
                echo "  Use ! after type: feat!: breaking change description"
                echo ""
                echo "Examples:"
                echo "  ✓ feat: add deregistration delay configuration"
                echo "  ✓ fix: correct unhealthy threshold variable name"
                echo "  ✓ security: add S3 bucket encryption for access logs"
                echo "  ✓ docs: improve variable descriptions using HEREDOC"
                echo "  ✓ feat(alb): add listener rule priority documentation"
                echo "  ✓ feat!: remove deprecated variables (breaking change)"
                echo ""
                echo "Your message:"
                echo "  $commit_msg"
                echo ""
                echo "See: https://www.conventionalcommits.org/"
                exit 1
            fi
            
            # Success - message is valid
            exit 0
        EOT
      + file                         = "./hooks/commit-msg"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-tcp-pod"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-teleport"].github_repository_file.commit_msg_hook[0] will be created
  + resource "github_repository_file" "commit_msg_hook" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add commit-msg hook"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            #!/usr/bin/env bash
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            
            # Validates commit messages follow conventional commit format
            # See: https://www.conventionalcommits.org/
            
            set -e
            
            commit_msg_file=$1
            commit_msg=$(cat "$commit_msg_file")
            
            # Skip validation for merge commits
            if echo "$commit_msg" | grep -qE '^Merge (branch|pull request)'; then
                exit 0
            fi
            
            # Conventional commit pattern
            # Supports: type(scope): description or type: description
            # Types: feat, fix, docs, style, refactor, perf, test, build, ci, chore, revert, security
            # Optional ! for breaking changes: feat!: description
            pattern='^(feat|fix|docs|style|refactor|perf|test|build|ci|chore|revert|security)(\(.+\))?!?: .{1,}'
            
            if ! echo "$commit_msg" | grep -qE "$pattern"; then
                echo "❌ Invalid commit message format"
                echo ""
                echo "📝 Commit message must follow Conventional Commits:"
                echo ""
                echo "  <type>[optional scope][!]: <description>"
                echo ""
                echo "  [optional body]"
                echo ""
                echo "  [optional footer(s)]"
                echo ""
                echo "Types:"
                echo "  feat:     ✨ New feature"
                echo "  fix:      🐛 Bug fix"
                echo "  docs:     📚 Documentation changes"
                echo "  security: 🔒 Security improvements"
                echo "  refactor: ♻️  Code refactoring (no functional changes)"
                echo "  perf:     ⚡ Performance improvement"
                echo "  test:     ✅ Adding or updating tests"
                echo "  build:    🔧 Build system or dependency changes"
                echo "  ci:       👷 CI/CD configuration changes"
                echo "  chore:    🔨 Maintenance tasks"
                echo "  revert:   ⏪ Revert a previous commit"
                echo "  style:    💄 Code style changes (formatting, etc.)"
                echo ""
                echo "Breaking changes:"
                echo "  Use ! after type: feat!: breaking change description"
                echo ""
                echo "Examples:"
                echo "  ✓ feat: add deregistration delay configuration"
                echo "  ✓ fix: correct unhealthy threshold variable name"
                echo "  ✓ security: add S3 bucket encryption for access logs"
                echo "  ✓ docs: improve variable descriptions using HEREDOC"
                echo "  ✓ feat(alb): add listener rule priority documentation"
                echo "  ✓ feat!: remove deprecated variables (breaking change)"
                echo ""
                echo "Your message:"
                echo "  $commit_msg"
                echo ""
                echo "See: https://www.conventionalcommits.org/"
                exit 1
            fi
            
            # Success - message is valid
            exit 0
        EOT
      + file                         = "./hooks/commit-msg"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-teleport"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-teleport-agent"].github_repository_file.commit_msg_hook[0] will be created
  + resource "github_repository_file" "commit_msg_hook" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add commit-msg hook"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            #!/usr/bin/env bash
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            
            # Validates commit messages follow conventional commit format
            # See: https://www.conventionalcommits.org/
            
            set -e
            
            commit_msg_file=$1
            commit_msg=$(cat "$commit_msg_file")
            
            # Skip validation for merge commits
            if echo "$commit_msg" | grep -qE '^Merge (branch|pull request)'; then
                exit 0
            fi
            
            # Conventional commit pattern
            # Supports: type(scope): description or type: description
            # Types: feat, fix, docs, style, refactor, perf, test, build, ci, chore, revert, security
            # Optional ! for breaking changes: feat!: description
            pattern='^(feat|fix|docs|style|refactor|perf|test|build|ci|chore|revert|security)(\(.+\))?!?: .{1,}'
            
            if ! echo "$commit_msg" | grep -qE "$pattern"; then
                echo "❌ Invalid commit message format"
                echo ""
                echo "📝 Commit message must follow Conventional Commits:"
                echo ""
                echo "  <type>[optional scope][!]: <description>"
                echo ""
                echo "  [optional body]"
                echo ""
                echo "  [optional footer(s)]"
                echo ""
                echo "Types:"
                echo "  feat:     ✨ New feature"
                echo "  fix:      🐛 Bug fix"
                echo "  docs:     📚 Documentation changes"
                echo "  security: 🔒 Security improvements"
                echo "  refactor: ♻️  Code refactoring (no functional changes)"
                echo "  perf:     ⚡ Performance improvement"
                echo "  test:     ✅ Adding or updating tests"
                echo "  build:    🔧 Build system or dependency changes"
                echo "  ci:       👷 CI/CD configuration changes"
                echo "  chore:    🔨 Maintenance tasks"
                echo "  revert:   ⏪ Revert a previous commit"
                echo "  style:    💄 Code style changes (formatting, etc.)"
                echo ""
                echo "Breaking changes:"
                echo "  Use ! after type: feat!: breaking change description"
                echo ""
                echo "Examples:"
                echo "  ✓ feat: add deregistration delay configuration"
                echo "  ✓ fix: correct unhealthy threshold variable name"
                echo "  ✓ security: add S3 bucket encryption for access logs"
                echo "  ✓ docs: improve variable descriptions using HEREDOC"
                echo "  ✓ feat(alb): add listener rule priority documentation"
                echo "  ✓ feat!: remove deprecated variables (breaking change)"
                echo ""
                echo "Your message:"
                echo "  $commit_msg"
                echo ""
                echo "See: https://www.conventionalcommits.org/"
                exit 1
            fi
            
            # Success - message is valid
            exit 0
        EOT
      + file                         = "./hooks/commit-msg"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-teleport-agent"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-terraformer"].github_repository_file.commit_msg_hook[0] will be created
  + resource "github_repository_file" "commit_msg_hook" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add commit-msg hook"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            #!/usr/bin/env bash
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            
            # Validates commit messages follow conventional commit format
            # See: https://www.conventionalcommits.org/
            
            set -e
            
            commit_msg_file=$1
            commit_msg=$(cat "$commit_msg_file")
            
            # Skip validation for merge commits
            if echo "$commit_msg" | grep -qE '^Merge (branch|pull request)'; then
                exit 0
            fi
            
            # Conventional commit pattern
            # Supports: type(scope): description or type: description
            # Types: feat, fix, docs, style, refactor, perf, test, build, ci, chore, revert, security
            # Optional ! for breaking changes: feat!: description
            pattern='^(feat|fix|docs|style|refactor|perf|test|build|ci|chore|revert|security)(\(.+\))?!?: .{1,}'
            
            if ! echo "$commit_msg" | grep -qE "$pattern"; then
                echo "❌ Invalid commit message format"
                echo ""
                echo "📝 Commit message must follow Conventional Commits:"
                echo ""
                echo "  <type>[optional scope][!]: <description>"
                echo ""
                echo "  [optional body]"
                echo ""
                echo "  [optional footer(s)]"
                echo ""
                echo "Types:"
                echo "  feat:     ✨ New feature"
                echo "  fix:      🐛 Bug fix"
                echo "  docs:     📚 Documentation changes"
                echo "  security: 🔒 Security improvements"
                echo "  refactor: ♻️  Code refactoring (no functional changes)"
                echo "  perf:     ⚡ Performance improvement"
                echo "  test:     ✅ Adding or updating tests"
                echo "  build:    🔧 Build system or dependency changes"
                echo "  ci:       👷 CI/CD configuration changes"
                echo "  chore:    🔨 Maintenance tasks"
                echo "  revert:   ⏪ Revert a previous commit"
                echo "  style:    💄 Code style changes (formatting, etc.)"
                echo ""
                echo "Breaking changes:"
                echo "  Use ! after type: feat!: breaking change description"
                echo ""
                echo "Examples:"
                echo "  ✓ feat: add deregistration delay configuration"
                echo "  ✓ fix: correct unhealthy threshold variable name"
                echo "  ✓ security: add S3 bucket encryption for access logs"
                echo "  ✓ docs: improve variable descriptions using HEREDOC"
                echo "  ✓ feat(alb): add listener rule priority documentation"
                echo "  ✓ feat!: remove deprecated variables (breaking change)"
                echo ""
                echo "Your message:"
                echo "  $commit_msg"
                echo ""
                echo "See: https://www.conventionalcommits.org/"
                exit 1
            fi
            
            # Success - message is valid
            exit 0
        EOT
      + file                         = "./hooks/commit-msg"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-terraformer"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-truststore"].github_repository_file.commit_msg_hook[0] will be created
  + resource "github_repository_file" "commit_msg_hook" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add commit-msg hook"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            #!/usr/bin/env bash
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            
            # Validates commit messages follow conventional commit format
            # See: https://www.conventionalcommits.org/
            
            set -e
            
            commit_msg_file=$1
            commit_msg=$(cat "$commit_msg_file")
            
            # Skip validation for merge commits
            if echo "$commit_msg" | grep -qE '^Merge (branch|pull request)'; then
                exit 0
            fi
            
            # Conventional commit pattern
            # Supports: type(scope): description or type: description
            # Types: feat, fix, docs, style, refactor, perf, test, build, ci, chore, revert, security
            # Optional ! for breaking changes: feat!: description
            pattern='^(feat|fix|docs|style|refactor|perf|test|build|ci|chore|revert|security)(\(.+\))?!?: .{1,}'
            
            if ! echo "$commit_msg" | grep -qE "$pattern"; then
                echo "❌ Invalid commit message format"
                echo ""
                echo "📝 Commit message must follow Conventional Commits:"
                echo ""
                echo "  <type>[optional scope][!]: <description>"
                echo ""
                echo "  [optional body]"
                echo ""
                echo "  [optional footer(s)]"
                echo ""
                echo "Types:"
                echo "  feat:     ✨ New feature"
                echo "  fix:      🐛 Bug fix"
                echo "  docs:     📚 Documentation changes"
                echo "  security: 🔒 Security improvements"
                echo "  refactor: ♻️  Code refactoring (no functional changes)"
                echo "  perf:     ⚡ Performance improvement"
                echo "  test:     ✅ Adding or updating tests"
                echo "  build:    🔧 Build system or dependency changes"
                echo "  ci:       👷 CI/CD configuration changes"
                echo "  chore:    🔨 Maintenance tasks"
                echo "  revert:   ⏪ Revert a previous commit"
                echo "  style:    💄 Code style changes (formatting, etc.)"
                echo ""
                echo "Breaking changes:"
                echo "  Use ! after type: feat!: breaking change description"
                echo ""
                echo "Examples:"
                echo "  ✓ feat: add deregistration delay configuration"
                echo "  ✓ fix: correct unhealthy threshold variable name"
                echo "  ✓ security: add S3 bucket encryption for access logs"
                echo "  ✓ docs: improve variable descriptions using HEREDOC"
                echo "  ✓ feat(alb): add listener rule priority documentation"
                echo "  ✓ feat!: remove deprecated variables (breaking change)"
                echo ""
                echo "Your message:"
                echo "  $commit_msg"
                echo ""
                echo "See: https://www.conventionalcommits.org/"
                exit 1
            fi
            
            # Success - message is valid
            exit 0
        EOT
      + file                         = "./hooks/commit-msg"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-truststore"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-update-dns"].github_repository_file.commit_msg_hook[0] will be created
  + resource "github_repository_file" "commit_msg_hook" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add commit-msg hook"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            #!/usr/bin/env bash
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            
            # Validates commit messages follow conventional commit format
            # See: https://www.conventionalcommits.org/
            
            set -e
            
            commit_msg_file=$1
            commit_msg=$(cat "$commit_msg_file")
            
            # Skip validation for merge commits
            if echo "$commit_msg" | grep -qE '^Merge (branch|pull request)'; then
                exit 0
            fi
            
            # Conventional commit pattern
            # Supports: type(scope): description or type: description
            # Types: feat, fix, docs, style, refactor, perf, test, build, ci, chore, revert, security
            # Optional ! for breaking changes: feat!: description
            pattern='^(feat|fix|docs|style|refactor|perf|test|build|ci|chore|revert|security)(\(.+\))?!?: .{1,}'
            
            if ! echo "$commit_msg" | grep -qE "$pattern"; then
                echo "❌ Invalid commit message format"
                echo ""
                echo "📝 Commit message must follow Conventional Commits:"
                echo ""
                echo "  <type>[optional scope][!]: <description>"
                echo ""
                echo "  [optional body]"
                echo ""
                echo "  [optional footer(s)]"
                echo ""
                echo "Types:"
                echo "  feat:     ✨ New feature"
                echo "  fix:      🐛 Bug fix"
                echo "  docs:     📚 Documentation changes"
                echo "  security: 🔒 Security improvements"
                echo "  refactor: ♻️  Code refactoring (no functional changes)"
                echo "  perf:     ⚡ Performance improvement"
                echo "  test:     ✅ Adding or updating tests"
                echo "  build:    🔧 Build system or dependency changes"
                echo "  ci:       👷 CI/CD configuration changes"
                echo "  chore:    🔨 Maintenance tasks"
                echo "  revert:   ⏪ Revert a previous commit"
                echo "  style:    💄 Code style changes (formatting, etc.)"
                echo ""
                echo "Breaking changes:"
                echo "  Use ! after type: feat!: breaking change description"
                echo ""
                echo "Examples:"
                echo "  ✓ feat: add deregistration delay configuration"
                echo "  ✓ fix: correct unhealthy threshold variable name"
                echo "  ✓ security: add S3 bucket encryption for access logs"
                echo "  ✓ docs: improve variable descriptions using HEREDOC"
                echo "  ✓ feat(alb): add listener rule priority documentation"
                echo "  ✓ feat!: remove deprecated variables (breaking change)"
                echo ""
                echo "Your message:"
                echo "  $commit_msg"
                echo ""
                echo "See: https://www.conventionalcommits.org/"
                exit 1
            fi
            
            # Success - message is valid
            exit 0
        EOT
      + file                         = "./hooks/commit-msg"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-update-dns"
      + sha                          = (known after apply)
    }

  # module.repos["terraform-aws-website-pod"].github_repository_file.commit_msg_hook[0] will be created
  + resource "github_repository_file" "commit_msg_hook" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add commit-msg hook"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            #!/usr/bin/env bash
            # This file is managed by Terraform in github-control repository
            # Do not edit this file, all changes will be overwritten
            # If you need to change this file, create a pull request in
            # https://github.com/infrahouse8/github-control
            
            # Validates commit messages follow conventional commit format
            # See: https://www.conventionalcommits.org/
            
            set -e
            
            commit_msg_file=$1
            commit_msg=$(cat "$commit_msg_file")
            
            # Skip validation for merge commits
            if echo "$commit_msg" | grep -qE '^Merge (branch|pull request)'; then
                exit 0
            fi
            
            # Conventional commit pattern
            # Supports: type(scope): description or type: description
            # Types: feat, fix, docs, style, refactor, perf, test, build, ci, chore, revert, security
            # Optional ! for breaking changes: feat!: description
            pattern='^(feat|fix|docs|style|refactor|perf|test|build|ci|chore|revert|security)(\(.+\))?!?: .{1,}'
            
            if ! echo "$commit_msg" | grep -qE "$pattern"; then
                echo "❌ Invalid commit message format"
                echo ""
                echo "📝 Commit message must follow Conventional Commits:"
                echo ""
                echo "  <type>[optional scope][!]: <description>"
                echo ""
                echo "  [optional body]"
                echo ""
                echo "  [optional footer(s)]"
                echo ""
                echo "Types:"
                echo "  feat:     ✨ New feature"
                echo "  fix:      🐛 Bug fix"
                echo "  docs:     📚 Documentation changes"
                echo "  security: 🔒 Security improvements"
                echo "  refactor: ♻️  Code refactoring (no functional changes)"
                echo "  perf:     ⚡ Performance improvement"
                echo "  test:     ✅ Adding or updating tests"
                echo "  build:    🔧 Build system or dependency changes"
                echo "  ci:       👷 CI/CD configuration changes"
                echo "  chore:    🔨 Maintenance tasks"
                echo "  revert:   ⏪ Revert a previous commit"
                echo "  style:    💄 Code style changes (formatting, etc.)"
                echo ""
                echo "Breaking changes:"
                echo "  Use ! after type: feat!: breaking change description"
                echo ""
                echo "Examples:"
                echo "  ✓ feat: add deregistration delay configuration"
                echo "  ✓ fix: correct unhealthy threshold variable name"
                echo "  ✓ security: add S3 bucket encryption for access logs"
                echo "  ✓ docs: improve variable descriptions using HEREDOC"
                echo "  ✓ feat(alb): add listener rule priority documentation"
                echo "  ✓ feat!: remove deprecated variables (breaking change)"
                echo ""
                echo "Your message:"
                echo "  $commit_msg"
                echo ""
                echo "See: https://www.conventionalcommits.org/"
                exit 1
            fi
            
            # Success - message is valid
            exit 0
        EOT
      + file                         = "./hooks/commit-msg"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "terraform-aws-website-pod"
      + sha                          = (known after apply)
    }

Plan: 47 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtZ2l0aHViLWNvbnRyb2wtc3RhdGUvdGVycmFmb3JtLnRmc3RhdGUiOiB7InN1Y2Nlc3MiOiB0cnVlLCAiYWRkIjogNDcsICJjaGFuZ2UiOiAwLCAiZGVzdHJveSI6IDB9fQ==
```
</details>